[
  {
    "title": "Dow Jones Futures Fall As Government Shutdown Begins After Nvidia Breaks Out - Investor's Business Daily",
    "source": "Investor's Business Daily",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNWmlFbF9nMDhfbzQxWjRZbU5PZTQzUWhRTVBZOEk0ZHMydVlLT2NNcVB0ME56UmlWTW5jb1hoUFRXUFUxX2d6TkpUbno4X1ZjWEdjV2w1SktKNnhicjk2MG9IeGoyOU5KclBwZERFTGE5VVRWUjMzN096OGhXQ2kwcUF2RTcycE1Md1N6THItYjBNN2ctZTI3NGRFLXkzVlhnNFR0STlYTUNialpFYWtoWXdVMA?oc=5",
    "published_date": "2025-10-01 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiswFBVV95cUxNWmlFbF9nMDhfbzQxWjRZbU5PZTQzUWhRTVBZOEk0ZHMydVlLT2NNcVB0ME56UmlWTW5jb1hoUFRXUFUxX2d6TkpUbno4X1ZjWEdjV2w1SktKNnhicjk2MG9IeGoyOU5KclBwZERFTGE5VVRWUjMzN096OGhXQ2kwcUF2RTcycE1Md1N6THItYjBNN2ctZTI3NGRFLXkzVlhnNFR0STlYTUNialpFYWtoWXdVMA?oc=5\" target=\"_blank\">Dow Jones Futures Fall As Government Shutdown Begins After Nvidia Breaks Out</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor's Business Daily</font>",
    "content": "Dow Jones futures fell early Wednesday, along with S&P 500 futures and Nasdaq futures, with a government shutdown underway. Dow giant Nike (NKE) rose on strong earnings after the close.  The stock market rally finished slightly higher Tuesday, with the Dow Jones setting a record close, to cap another strong month and quarter. NOW PLAYING These Companies Want To Replace Nvidia In China. Can They Succeed? Nvidia (NVDA) broke out of a base while CoreWeave (CRWV) gapped up on news. Palantir Technologies (PLTR) is setting up just below a buy point. The video embedded in the article reviews Tuesday's market action and analyzes Nvidia, Ralph Lauren (RL) and Pagaya stock. Government Shutdown The federal government's funding ran out at midnight, triggering a partial government shutdown. Democrats are demanding that President Donald Trump extend expiring ObamaCare subsidies and reverse recent Medicaid cuts. Trump has threatened to fire a slew of federal workers permanently in a shutdown. Tesla China Finishes Q3 Strong But Global Deliveries Are All About This Dow Jones Futures Today Dow Jones futures lost 0.3% vs. fair value, even with Nike giving blue chips a lift. S&P 500 futures fell 0.4% and Nasdaq 100 futures declined 0.5%. Futures are off overnight lows. Investors will get the ADP Employment report for September at 8:15 a.m. ET. The September ISM manufacturing index and August construction spending data are due at 10 a.m. ET.\n\nRemember that overnight action in Dow futures and elsewhere doesn't necessarily translate into actual trading in the next regular stock market session.\n\nJoin IBD experts as they analyze leading stocks and the market on IBD Live\nNike Earnings\n\nNike earnings topped fiscal Q1 views Tuesday night while sales unexpectedly edged higher, signaling a turnaround is underway.\n\nNKE stock rose solidly overnight, signaling a move above a long-sliding 200-day moving average. Shares edged higher Tuesday.\nU.S. To Take Lithium Americas Stake\n\nLithium Americas (LAC) surged overnight after Secretary of Energy Chris Wright said that the U.S. government will take a stake in the Canadian lithium producer, confirming recent reports.\nTesla Rivals Report Record Deliveries\n\nTesla (TSLA) rivals XPeng (XPEV), Nio (NIO) and Xiaomi (XIACY) reported record monthly and quarterly deliveries overnight, BYD (BYDDF) had lackluster sales at best while Li Auto (LI) released weak results.\n\nTesla reports Q3 deliveries before Thursday's open. The EV giant significantly raised U.S. lease prices on Oct. 1, following the Sept. 30 expiration of the $7,500 EV tax credit.\nStock Market Rally\n\nThe stock market rally was slightly lower for much of the session but firmed up late for modest gains.\n\nThe Dow Jones Industrial Average rose 0.2% in Tuesday's stock market trading, a new closing high. The S&P 500 index advanced 0.4%. The Nasdaq composite climbed 0.3%. The small-cap Russell 2000 edged up less than 0.1%, rebounding higher from the 21-day line.\n\nFor the month, the Dow rose 1.9%, the S&P 500 3.5%, the Nasdaq 5.6% and the Russell 2000 3%.\n\nLeading stocks were mixed Tuesday. Nvidia and CoreWeave were among the winners, but losers predominated Tuesday.\n\nBut Spotify (SPOT) fell back from a buy area while payment and lending stocks such as Pagaya Technologies (PGY) and SoFi Technologies (SOFI) were notable losers.\n\nSports-betting plays such as DraftKings (DKNG) sold off a day after Robinhood Markets (HOOD) touted significant inroads into prediction markets.\n\nU.S. crude oil prices fell 1.7% to $62.37 a barrel amid reports that OPEC+ is mulling a big November production hike on Sunday.\n\nThe 10-year Treasury yield rose 1 basis point to 4.15%. A lengthy government shutdown could unnerve bond markets. The government won't release economic data during a shutdown, including the September jobs report scheduled for Friday.\nETFs\n\nAmong growth ETFs, the Innovator IBD 50 ETF (FFTY) dipped 0.3%. The iShares Expanded