[
  {
    "title": "Dow Jones Futures Fall As Government Shutdown Begins After Nvidia Breaks Out - Investor's Business Daily",
    "source": "Investor's Business Daily",
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxNWmlFbF9nMDhfbzQxWjRZbU5PZTQzUWhRTVBZOEk0ZHMydVlLT2NNcVB0ME56UmlWTW5jb1hoUFRXUFUxX2d6TkpUbno4X1ZjWEdjV2w1SktKNnhicjk2MG9IeGoyOU5KclBwZERFTGE5VVRWUjMzN096OGhXQ2kwcUF2RTcycE1Md1N6THItYjBNN2ctZTI3NGRFLXkzVlhnNFR0STlYTUNialpFYWtoWXdVMA?oc=5",
    "published_date": "2025-10-01 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiswFBVV95cUxNWmlFbF9nMDhfbzQxWjRZbU5PZTQzUWhRTVBZOEk0ZHMydVlLT2NNcVB0ME56UmlWTW5jb1hoUFRXUFUxX2d6TkpUbno4X1ZjWEdjV2w1SktKNnhicjk2MG9IeGoyOU5KclBwZERFTGE5VVRWUjMzN096OGhXQ2kwcUF2RTcycE1Md1N6THItYjBNN2ctZTI3NGRFLXkzVlhnNFR0STlYTUNialpFYWtoWXdVMA?oc=5\" target=\"_blank\">Dow Jones Futures Fall As Government Shutdown Begins After Nvidia Breaks Out</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor's Business Daily</font>",
    "content": "Dow Jones futures fell early Wednesday, along with S&P 500 futures and Nasdaq futures, with a government shutdown underway. Dow giant Nike (NKE) rose on strong earnings after the close. The stock market rally finished slightly higher Tuesday, with the Dow Jones setting a record close, to cap another strong month and quarter. NOW PLAYING These Companies Want To Replace Nvidia In China. Can They Succeed? Nvidia (NVDA) broke out of a base while CoreWeave (CRWV) gapped up on news. Palantir Technologies (PLTR) is setting up just below a buy point. The video embedded in the article reviews Tuesday's market action and analyzes Nvidia, Ralph Lauren (RL) and Pagaya stock. Government Shutdown The federal government's funding ran out at midnight, triggering a partial government shutdown. Democrats are demanding that President Donald Trump extend expiring ObamaCare subsidies and reverse recent Medicaid cuts. Trump has threatened to fire a slew of federal workers permanently in a shutdown. Tesla China Finishes Q3 Strong But Global Deliveries Are All About This Dow Jones Futures Today Dow Jones futures lost 0.3% vs. fair value, even with Nike giving blue chips a lift. S&P 500 futures fell 0.4% and Nasdaq 100 futures declined 0.5%. Futures are off overnight lows. Investors will get the ADP Employment report for September at 8:15 a.m. ET. The September ISM manufacturing index and August construction spending data are due at 10 a.m. ET.\n\nRemember that overnight action in Dow futures and elsewhere doesn't necessarily translate into actual trading in the next regular stock market session.\n\nJoin IBD experts as they analyze leading stocks and the market on IBD Live\n\nNike Earnings\n\nNike earnings topped fiscal Q1 views Tuesday night while sales unexpectedly edged higher, signaling a turnaround is underway.\n\nNKE stock rose solidly overnight, signaling a move above a long-sliding 200-day moving average. Shares edged higher Tuesday.\n\nU.S. To Take Lithium Americas Stake\n\nLithium Americas (LAC) surged overnight after Secretary of Energy Chris Wright said that the U.S. government will take a stake in the Canadian lithium producer, confirming recent reports.\n\nTesla Rivals Report Record Deliveries\n\nTesla (TSLA) rivals XPeng (XPEV), Nio (NIO) and Xiaomi (XIACY) reported record monthly and quarterly deliveries overnight, BYD (BYDDF) had lackluster sales at best while Li Auto (LI) released weak results.\n\nTesla reports Q3 deliveries before Thursday's open. The EV giant significantly raised U.S. lease prices on Oct. 1, following the Sept. 30 expiration of the $7,500 EV tax credit.\n\nStock Market Rally\n\nThe stock market rally was slightly lower for much of the session but firmed up late for modest gains.\n\nThe Dow Jones Industrial Average rose 0.2% in Tuesday's stock market trading, a new closing high. The S&P 500 index advanced 0.4%. The Nasdaq composite climbed 0.3%. The small-cap Russell 2000 edged up less than 0.1%, rebounding higher from the 21-day line.\n\nFor the month, the Dow rose 1.9%, the S&P 500 3.5%, the Nasdaq 5.6% and the Russell 2000 3%.\n\nLeading stocks were mixed Tuesday. Nvidia and CoreWeave were among the winners, but losers predominated Tuesday.\n\nBut Spotify (SPOT) fell back from a buy area while payment and lending stocks such as Pagaya Technologies (PGY) and SoFi Technologies (SOFI) were notable losers.\n\nSports-betting plays such as DraftKings (DKNG) sold off a day after Robinhood Markets (HOOD) touted significant inroads into prediction markets.\n\nU.S. crude oil prices fell 1.7% to $62.37 a barrel amid reports that OPEC+ is mulling a big November production hike on Sunday.\n\nThe 10-year Treasury yield rose 1 basis point to 4.15%. A lengthy government shutdown could unnerve bond markets. The government won't release economic data during a shutdown, including the September jobs report scheduled for Friday.\n\nETFs\n\nAmong growth ETFs, the Innovator IBD 50 ETF (FFTY) dipped 0.3%. The iShares Expanded Tech-Software Sector ETF (IGV) fell 0.8%, with Palantir stock the biggest component. The VanEck Vectors Semiconductor ETF (SMH) rallied 1.15%. Nvidia stock is the No. 1 holding in SMH.\n\nARK Innovation ETF (ARKK) edged up 0.15% and ARK Genomics ETF (ARKG) gained 1.8%. Tesla stock is the No. 1 holding across ARK Invest's ETFs.\n\nSPDR S&P Metals & Mining ETF (XME) declined 0.3%. The Energy Select SPDR ETF (XLE) retreated 1.1% and the Health Care Select Sector SPDR Fund (XLV) popped 2.4%. The Industrial Select Sector SPDR Fund (XLI) advanced 0.8%. The Financial Select SPDR ETF (XLF) shed 0.5%.\n\nBest Growth Stocks To Buy And Watch\n\nNvidia Stock\n\nNvidia stock rallied 2.6% to 186.58, clearing a 184.48 flat-base buy point after finding support at the 50-day line last week.\n\nCoreWeave Stock\n\nCoreWeave stock gapped up 11.7% to 136.85, briefly topping a 138.95 short-term high. The Nvidia-backed IPO jumped on an expanded cloud-computing deal with Meta Platforms (META).\n\nPalantir Stock\n\nPalantir stock advanced 2% to 182.42, trading within a cup-with-handle base with a 185.75 buy point, according to MarketSurge. PLTR stock arguably is offering an early entry.\n\nWhat To Do Now\n\nThe stock market rally continues to trend higher. A lengthy government shutdown could have stock market implications, but Wall Street isn't concerned so far.\n\nInvestors should be heavily invested.\n\nMany leaders are significantly extended, but Nvidia breaking out and Palantir just below a buy point shows that investors should still be looking for new opportunities.\n\nSome leaders have weakened, though, often around buy points like Spotify and Roblox.\n\nSo stay engaged and ready to act, in either direction.\n\nPalantir is on IBD Leaderboard, with Tesla on the Leaderboard watchlist. Nvidia stock, SoFi, Palantir are on the IBD 50. SoFi stock and Palantir are on the IBD Big Cap 20.\n\nRead The Big Picture every day to stay in sync with the market direction and leading stocks and sectors.",
    "\n  },\n  {\n    \"title": "Dow, S&P 500, Nasdaq notch records on AI buzz even as government shutdown drags on - Yahoo Finance"
  },
  {
    "source": "Yahoo Finance",
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxOcUM0Ti1BWGZqYnZGLVpxOHFfaFdRXzVpcXZjRFpyM2VFZW5oWWtBZjRzMUdXS1NwZEN1NTI1ZmZLOXNEeDRuNnRIc240YkZGOEI0MUJ1UU0tdGd1UmpCeEkzRkdmQkUwRXNtWnMzTjMzcTh6eTU1VFRaenJ4WmFqMWg0QUlwekFYcC1RS29HdUtyckVmbk05YTUyendvQktqQl80R1F3V0I1VF9yY25JbUQ0UzA0bVZCanhIVWxUck5hdnNUUjh2d2x3?oc=5",
    "published_date": "2025-10-02 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiygFBVV95cUxOcUM0Ti1BWGZqYnZGLVpxOHFfaFdRXzVpcXZjRFpyM2VFZW5oWWtBZjRzMUdXS1NwZEN1NTI1ZmZLOXNEeDRuNnRIc240YkZGOEI0MUJ1UU0tdGd1UmpCeEkzRkdmQkUwRXNtWnMzTjMzcTh6eTU1VFRaenJ4WmFqMWg0QUlwekFYcC1RS29HdUtyckVmbk05YTUyendvQktqQl80R1F3V0I1VF9yY25JbUQ0UzA0bVZCanhIVWxUck5hdnNUUjh2d2x3?oc=5\" target=\"_blank\">Dow, S&amp;P 500, Nasdaq notch records on AI buzz even as government shutdown drags on</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "content": "US stocks rose on Thursday as the AI trade continued to power a push for fresh records amid new buzz around OpenAI (OPAI.PVT). Meanwhile, investors kept an eye on developments in Washington, weighing the chances of a lengthy US government shutdown.\n\nThe tech-heavy Nasdaq Composite (^IXIC) rose 0.4%. The S&P 500 (^GSPC) gained 0.1%. The Dow Jones Industrial Average (^DJI) rose 0.2%. All three major averages posted new records.\n\nDJI - Delayed Quote • USD\n\nDow Jones Industrial Average (^DJI)\n\n47,147.48\n\n-309.72\n\n(-0.65%)\n\nAt close: November 14 at 4:59:07 PM EST\n\n^DJI ^IXIC ^GSPC\n\nAdvanced Chart\n\nDate \t3/14/2025\n\nClose \t41,488.19\n\nOpen \t41,057.57\n\nHigh \t41,528.11\n\nLow \t40,929.54\n\n^IXIC\t17,754.09\n\n^GSPC\t5,638.94\n\nStocks rose one day after the S&P 500 closed above 6,700 for the first time. A wave of good news from the AI sector lifted chip stocks worldwide, with Nvidia (NVDA) rising to a record high. AMD (AMD) and SK Hynix (000660.KS, HXSCL) also gained.\n\nOpenAI's (OPAI.PVT) valuation soared to $500 billion after an employee share sale, boosting tech rally hopes despite fears of an AI bubble. The ChatGPT maker ousted Elon Musk's SpaceX (SPAX.PVT) as the most valuable startup in the world.\n\nMarkets have so far been unperturbed by the US government shutdown, which looks set to drag on at least until the end of the week. President Trump is amping up his rhetoric against Democrats, threatening to fire \"thousands\" of federal workers and canceling billions of dollars in federal funding to blue states.\n\nTrump said he is meeting on Thursday with OMB Director Russ Vought, who has been leading White House strategy in the shutdown, to discuss which \"Democrat Agencies\" should be cut.\n\nIn any case, Friday's scheduled release of the September jobs report is all but certain to be delayed. That has Wall Street looking elsewhere during the federal data blackout, as Fed policymakers have indicated cracks in the labor market will loom large in their October rate decision.\n\nPrivate data from the firm Challenger, Gray & Christmas released Thursday found hiring plans at their lowest level since 2009, even as layoffs fell. The report provided more evidence of the softening",
    "fire": "abor market after Wednesday's ADP report. Investors remain near-unanimous on bets for a cut at the Fed's next meeting.\n\nElsewhere in corporates, Tesla (TSLA) shares took a hit despite a record sales quarter as investors turned focus to future performance without the federal EV tax credit."
  },
  {
    "title": "CNBC Daily Open: The U.S. government shuts down after stocks end September buzzing - CNBC",
    "source": "CNBC",
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOUWZBR2g3WWVKRzZyUGtjYS1vMWl4dXNxQ3ZKYW15OEd2T2JwN2FhRUQ0elZEOG5xTVQ2ZER3X3JxV3RkUVNPNzhuMElJd1p6OVNCYjJYUV9XUFh3cURSRm9pOEtiTktIdmxNWXZiZEt4UmRCTjZEbDZNTHdPSWFSSUNWeDRoeENhRVliZE9Mb1NCTTNrenlHeWZtZmtFS2NkX3RUaTJ3enBhQ1dnUmhwejFSMlFrcFHSAbwBQVVfeXFMT2ZVYVlNUUtuWUw1cVdDWUNQVVNuVlpCQ3NOV1FsWktma3hWbGN3dUMxNEYzcFdCUUFqdjJLMTJBZzc4WFh3U2s2QTF6VTRJSmhmWTZDeWp5YXRhckNYaW5MTThFLWozZ0xYcHJUc1NfYWpOdlVIamc2M0k3a2x1am5LOGFvQklfNEF1NklPVW04M24zLTd5SGFMODZLYUVZUGJod3JWU0pFQ0pOZHhQaWFlRXU0YnA1SUtXV1U?oc=5",
    "published_date": "2025-10-01 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMitwFBVV95cUxOUWZBR2g3WWVKRzZyUGtjYS1vMWl4dXNxQ3ZKYW15OEd2T2JwN2FhRUQ0elZEOG5xTVQ2ZER3X3JxV3RkUVNPNzhuMElJd1p6OVNCYjJYUV9XUFh3cURSRm9pOEtiTktIdmxNWXZiZEt4UmRCTjZEbDZNTHdPSWFSSUNWeDRoeENhRVliZE9Mb1NCTTNrenlHeWZtZmtFS2NkX3RUaTJ3enBhQ1dnUmhwejFSMlFrcFHSAbwBQVVfeXFMT2ZVYVlNUUtuWUw1cVdDWUNQVVNuVlpCQ3NOV1FsWktma3hWbGN3dUMxNEYzcFdCUUFqdjJLMTJBZzc4WFh3U2s2QTF6VTRJSmhmWTZDeWp5YXRhckNYaW5MTThFLWozZ0xYcHJUc1NfYWpOdlVIamc2M0k3a2x1am5LOGFvQklfNEF1NklPVW04M24zLTd5SGFMODZLYUVZUGJod3JWU0pFQ0pOZHhQaWFlRXU0YnA1SUtXV1U?oc=5\" target=\"_blank\">CNBC Daily Open: The U.S. government shuts down after stocks end September buzzing</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "content": "The U.S. government has shut down.\n\nAround 750,000 federal employees— including those in the Bureau of Labor Statistics — might be furloughed, according to the Congressional Budget Office. If that happens, September’s jobs report will not be released as scheduled on Friday, leaving the Federal Reserve and investors in the dark about the state of the U.S. labor market.\n\nWhile the shutdown was only confirmed around 9 a.m. Singapore time (9 p.m. ET), it appeared imminent during trading hours Tuesday. But markets seemed to shrug off such concerns, with the Dow Jones Industrial Average\n\neven hitting a new high.\n\nShares of Nvidia\n\nalso closed at a record, which pushed the company past a $4.5 trillion market cap, while CoreWeave stock jumped nearly 12% on an artificial intelligence infrastructure agreement with Meta\n\n.\n\nIndeed, the flurry of AI deals announced during the month, with OpenAI at the center of many of them, turbocharged the stock market. In September, the S&P 500\n\nadded more than 3%, blowing past its historical average of a 4.2% fall for the month.\n\nWhile the U.S. government has been put to sleep as September ended, investors, hopefully, had their eyes peeled during the month.\n\nWhat you need to know today\n\nThe U.S. government shuts down. That’s the result of Republicans and Democrats failing to reach a deal to pass a stopgap funding bill. Catch the latest updates on the government shutdown on CNBC’s live blog.\n\nBerkshire Hathaway reportedly eyeing $10 billion deal. Warren Buffett’s conglomerate is reaching a deal to buy OxyChem, Occidental Petroleum’s petrochemical unit, according to The Wall Street Journal on Tuesday. If finalized, it’d be Berkshire’s\n\nbiggest deal since 2022.\n\nIndia holds interest rates steady. The Reserve Bank of India kept rates at 5.5% Wednesday, as expected by a Reuters poll of economists. June’s half-point cut hasn’t filtered through the economy, the RBI’s governor said.\n\nU.S. stocks end September higher. Major stock indexes rose Tuesday, with the Dow Jones Industrial Average closing at a record. Asia-Pacific markets were mixed Wednesday. Japan’s Nikkei 225 sank after a survey of business sentiment came in lower than expected.\n\n[PRO] Barclays’ picks for UK stocks. London’s FTSE 100\n\nhas outperformed the S&P 500 and the pan-European Stoxx 600 year to date. Barclays, in a Sept. 30 note, named its “best ideas” to play this market."
  },
  {
    "title": "S&P 500 hits record high despite government shutdown: what’s driving Wall Street today? - The Economic Times",
    "source": "The Economic Times",
    "url": "https://news.google.com/rss/articles/CBMihwNBVV95cUxOZkpNOG1sYmZXTkZWSEhUSktKMmNZMjZiU0xzcDRnTng1NkJaQlBJRGplQnFxRXZDWnE0UkJIem9BWTRsY3Z4eUhYeE1iSWdGN0ZCVFRtRkptLVVBVkZLTmpXTjQ5TzRwWXowa0NlNlVzXzA4T3NyckJQV2owUVk3UW9ldkExanRhUU1TYXVJVzl4VWN1TUV6LWxaZXVzeFNsUktRMkltbjRHY2JmbXVwUFc5STZ2eUxZUEh1Z2k3b0h0ZURweWRrYWN5dS1xTXpUX1U5OWRlUG40eDdfdTlKYXR4OGMyWUg0YTRBUkxKc2VqdnhUbTVpcEJqakIxYXlVTkg0MzRtYWYzNG5PVURpbG5oZDhlT2dTVW9OeEp1VzI2OFhadFdOM2xmS19Xa0NPNXNndEFCd2xCOVBiUlJpVTAzdnA4c29LNFZid005X1ZOQVVoRVlGQXJqMzgzM0R2WWFkaURmTnJYZnlqb3RoS0U1RUtVelZHd1prTm1SMzllTDQ2VUl30gGMA0FVX3lxTE1ZMzhCSk1VeWNUV3FYVGFBV2hWS0R4anJhRE9xRWdzV0dQS1M0QThmM2p5X2RpcU9iMGVPTE5sZl9xV2tuTlZWcEVMc05QbWM4M0t5RTFKZmNGZzNwcDU4YWUxZzc3SU16UFZ6OXhFRGpHX0ZTVzN4SGp6SXNFZnl5bXFUTF9YT1ZxOGtWSUZ2Rm1rMGloaHg3a0RQOEpGVy1zeHBKR0Z1OHBMN0xmYzFvVEFoTU9FV1RCVy1NUTdac0pWNjJHSElYOWVvZ1ZZU2Z3cU5WVGhBcFppMDFhUE9KU3d3cTZmbGhBdzEzWksta2llYTlYelhjWDlGZ3hIMGFVcUpUODNQZnE4R0NFMXI2YVFhcVk5ak50eXd1UURIMUZqd1h4b3doNXloR0lydVpOMFp5NWN2emxrZGZzdlFEWC1PeHMyWFFDbk43RWxjSDJKcUNNUkd0eE1RS3hYS2ZlM29jR2NOdG94akNWYWlFazRmc0JtUHhmWllOZGNqa1NCUUlscXo4R1FkRA?oc=5",
    "published_date": "2025-10-03 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMihwNBVV95cUxOZkpNOG1sYmZXTkZWSEhUSktKMmNZMjZiU0xzcDRnTng1NkJaQlBJRGplQnFxRXZDWnE0UkJIem9BWTRsY3Z4eUhYeE1iSWdGN0ZCVFRtRkptLVVBVkZLTmpXTjQ5TzRwWXowa0NlNlVzXzA4T3NyckJQV2owUVk3UW9ldkExanRhUU1TYXVJVzl4VWN1TUV6LWxaZXVzeFNsUktRMkltbjRHY2JmbXVwUFc5STZ2eUxZUEh1Z2k3b0h0ZURweWRrYWN5dS1xTXpUX1U5OWRlUG40eDdfdTlKYXR4OGMyWUg0YTRBUkxKc2VqdnhUbTVpcEJqakIxYXlVTkg0MzRtYWYzNG5PVURpbG5oZDhlT2dTVW9OeEp1VzI2OFhadFdOM2xmS19Xa0NPNXNndEFCd2xCOVBiUlJpVTAzdnA4c29LNFZid005X1ZOQVVoRVlGQXJqMzgzM0R2WWFkaURmTnJYZnlqb3RoS0U1RUtVelZHd1prTm1SMzllTDQ2VUl30gGMA0FVX3lxTE1ZMzhCSk1VeWNUV3FYVGFBV2hWS0R4anJhRE9xRWdzV0dQS1M0QThmM2p5X2RpcU9iMGVPTE5sZl9xV2tuTlZWcEVMc05QbWM4M0t5RTFKZmNGZzNwcDU4YWUxZzc3SU16UFZ6OXhFRGpHX0ZTVzN4SGp6SXNFZnl5bXFUTF9YT1ZxOGtWSUZ2Rm1rMGloaHg3a0RQOEpGVy1zeHBKR0Z1OHBMN0xmYzFvVEFoTU9FV1RCVy1NUTdac0pWNjJHSElYOWVvZ1ZZU2Z3cU5WVGhBcFppMDFhUE9KU3d3cTZmbGhBdzEzWksta2llYTlYelhjWDlGZ3hIMGFVcUpUODNQZnE4R0NFMXI2YVFhcVk5ak50eXd1UURIMUZqd1h4b3doNXloR0lydVpOMFp5NWN2emxrZGZzdlFEWC1PeHMyWFFDbk43RWxjSDJKcUNNUkd0eE1RS3hYS2ZlM29jR2NOdG94akNWYWlFazRmc0JtUHhmWllOZGNqa1NCUUlscXo4R1FkRA?oc=5\" target=\"_blank\">S&amp;P 500 hits record high despite government shutdown: what’s driving Wall Street today?</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times</font>",
    "content": "S&P 500 reached a new all-time high on Thursday, shrugging off concerns over the ongoing U.S. government shutdown. Investors focused on strong tech earnings, AI excitement, and expectations of upcoming Federal Reserve rate cuts. At the open, the S&P 500 rose 0.3%, while the Nasdaq jumped 0.6%. The Dow Jones Industrial Average added 49 points, or 0.1%."
  },
  {
    "title": "Markets News, Oct. 1, 2025: Stocks Rise for 4th Straight Session as Investors Shake Off Government Shutdown Concerns; Dow, S&P 500 Set Fresh Records - Investopedia",
    "source": "Investopedia",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE8tSmJaVVlwc0pDbHRwTFVfT3dteUN5S3ZTSEVzaW00VXNDVDdCaEZDcV9rYVJjOGdDYUVmcGJPYVdUbjk3TlN3dHViRXBUZVp4Y01kZk42cGpGVy0tUUhrRUFBZWotZFg0M01xTkNLMA?oc=5",
    "published_date": "2025-10-01 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE8tSmJaVVlwc0pDbHRwTFVfT3dteUN5S3ZTSEVzaW00VXNDVDdCaEZDcV9rYVJjOGdDYUVmcGJPYVdUbjk3TlN3dHViRXBUZVp4Y01kZk42cGpGVy0tUUhrRUFBZWotZFg0M01xTkNLMA?oc=5\" target=\"_blank\">Markets News, Oct. 1, 2025: Stocks Rise for 4th Straight Session as Investors Shake Off Government Shutdown Concerns; Dow, S&amp;P 500 Set Fresh Records</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>",
    "content": "Major stock indexes erased early declines to close higher for a fourth consecutive session Wednesday, shaking off a U.S. government shutdown and a surprising decrease in private-sector jobs.\n\nThe blue-chip Dow Jones Industrial Average rose 0.1% to close at a record high for a second straight day. The benchmark S&P 500 ended up 0.3% to set its own new closing high after earlier registering a fresh intraday record. The tech-heavy Nasdaq rose 0.4% and approached its intraday and closing records.\n\nGold futures were up 0.6% to $3,895 an ounce at 4:00 p.m. ET after earlier touching a record $3,922.70. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies, ticked lower to 97.71, while the 10-year Treasury yield—which affects borrowing costs on all sorts of loans—fell to 4.10% from 4.15% Tuesday. Bitcoin advanced 2.7% to about $117,500, while oil futures slipped 0.6% to about $62 per barrel.\n\nA midnight deadline to keep the government open came and went without Congress passing a measure, as Republicans and Democrats in Congress are at a standoff over healthcare funding. As a result, some government offices are closed and the shutdown could delay the release of crucial economic data, including Friday's report on the job market from the Bureau of Labor Statistics.\n\nAccording to ADP, the U.S. unexpectedly lost 32,000 private-sector jobs in September—the biggest decline since March 2023—in the latest sign of a weakening labor market. An increase of 45,000 jobs was seen, per economists surveyed by Dow Jones Newswires and The Wall Street Journal.\n\nIn corporate news, Nike (NKE) shares ended more than 6% higher after the sneaker giant surprisingly recorded a quarterly sales increase; Lithium Americas (LAC) stock popped 23% on news the U.S. government would take a stake in the Canadian company and its Nevada mining project; and Docusign (DOCU) shares, which sank 12% yesterday on news OpenAI is launching a competing product called DocuGPT, closed down a further 4%.\n\nAES (AES) shares soared nearly 17% to lead the S&P 500 in early trading on a Financial Times report that BlackRock (BLK)-owned Global Infrastructure Partners was near a deal to acquire the power plants operator for $38 billion. Shares of Intel (INTC) surged 7% on a report that the firm is in early stage talks with Advanced Micro Devices (AMD) to add its rival as a foundry customer.\n\nAlso, Pfizer (PFE) stock rose a further 7% a day after surging nearly 7% to pace the S&P 500 as it announced lower prices on several medications in the U.S. with President Trump at the White House. U.S.-listed shares of European drugmakers AstraZeneca (AZN) and Novo Nordisk (NVO) were up roughly 10% and 7%, respectively, and Eli Lilly (LLY) shares surged about 8% after Trump also revealed plans to launch a website for consumers to purchase drugs from manufacturers at a discount, helping provide clarity for the industry after the president had sent a letter over the summer urging pharma firms to lower costs for Americans.\n\nBiggest S&P 500 Movers on Wednesday\n\nOctober 01, 2025 06:31 PM EDT\n\nAdvancers\n\nShares of renewable energy provider AES (AES) surged nearly 17%, gaining the most of any S&P 500 stock. The push higher followed reports that Global Infrastructure Partners, owned by asset management giant BlackRock (BLK), is in talks to buy AES. The deal could be worth around $38 billion, which would make it one of the largest infrastructure takeovers ever.\n\nPharmaceutical stocks and others in the healthcare sector extended their gains Wednesday, a day after Pfizer (PFE) became the first major drugmaker to comply with a push from the White House cut medication prices in the U.S. to the lower levels seen in other countries. According to media reports, other major pharma companies could follow Pfizer's lead and seek pricing deals with the Trump administration. Shares of Biogen (BIIB), Thermo Fisher Scientific (TMO) and Eli Lilly (LLY) rose about 10%, 9% and 8%, respectively.\n\nShares of memory chip maker Micron Technology (MU) advanced close to 9%, along with hard drive makers Seagate Technology (STX) and Western Digital (WDC). The moves extended recent gains on anticipation they could benefit from growing demand for data storage to support AI.\n\nDecliners\n\nCorteva (CTVA) shares tumbled 9.1%, logging the S&P 500's weakest performance Wednesday, after the agricultural sciences firm announced a plan to split its crop protection and its seed businesses into two independent companies. The company expects the transaction to be complete by the second half of 2026.\n\nInterpublic Group (IPG) stock lost 5% on Wednesday, reversing gains posted in the prior session after German biotech giant Bayer (BAYRY) named IPG as the exclusive creative and media partner for its consumer health business. IPG and fellow marketing firm Omnicom (OMC) announced that the regulatory approval process for their intended merger remains in progress and that they expect the deal to close by year-end. Omnicom shares also slipped 5%.\n\nShares of tech-focused research firm Gartner (IT) fell 4.5%. Although the U.S. federal government accounts for less than 5% of Gartner's revenue, the government shutdown weighed on sentiment across the advisory industry. Gartner stock has also faced pressure stemming from concerns about how AI could disrupt the research business.\n\n-Michael Bromberg\n\nFermi Shares Soar in Trading Debut\n\nOctober 01, 2025 06:18 PM EDT\n\nShares of Fermi (FRMI), the developer of one of the world’s largest AI data center campuses, soared on their first day of trading Wednesday in yet another sign of Wall Street's appetite for all things AI.\n\nFermi stock rose 55% on Wednesday to close at $32.53, after pricing its IPO at $21 a share. The stock was up an additional 7% in after-hours trading.\n\nFermi is the latest in a string of AI-related IPOs that have attracted strong interest from investors this year. The stock of design software maker Figma (FIG) skyrocketed 250% in its first day of trading in July, and shares of cloud computing provider Coreweave (CRWV) are up more than 200% since their March debut.\n\nToby Neugebauer, chief executive officer of Fermi Inc., speaks before ringing the closing bell during the company's initial public offering (IPO) at the Nasdaq MarketSite in New York, US, on Wednesday, Oct. 1, 2025.\n\nFermi CEO Toby Neugebauer speaking Wednesday at the Nasdaq MarketSite.\n\nVictor J. Blue / Bloomberg / Getty Images\n\nFermi is an unconventional stock in several respects. First, it has no revenue. The company was founded in January and is in the early stages of developing the President Donald J. Trump Advanced Energy and Intelligence Campus, a huge data center facility situated on a 5,000-acre site in the Texas Panhandle. The plan is to build 15 million square feet of data center capacity—equivalent to about 260 football fields—that’s hooked up to 11 GW of natural gas, nuclear, and solar power. Fermi expects to break ground on its first data centers next March, and hopes to have 1.1 GW of power available to tenants by the end of next year.\n\nFermi’s listing as a real estate investment trust (REIT) also sets it apart from nearly every other AI investment. REITs are required to disburse 90% of their profit to investors, which isn't exactly conducive to funding the kind of explosive growth that most investors have come to expect from AI-related businesses. It will also likely be a while before Fermi can pay a dividend, considering it doesn't expect to have data centers available for lease before the end of next year.\n\nFermi's single-site portfolio is also highly unusual; most REITs, including competing data center landlords Digital Realty (DLR) and Equinix (EQIX), tout vast property portfolios that offer investors the benefits of diversification. Fermi's planned campus may be enormous, but it's still only one property.\n\n-Colin Laidley\n\nGovernment Shutdowns Usually Don't Bother Stocks. Could This Time Be Different?\n\nOctober 01, 2025 04:07 PM EDT\n\nThe federal government just shut down for the first time in six years, and the stock market—characteristically—took it in stride. But could that change?\n\nThe benchmark S&P 500 ended up 0.3% Wednesday. The muted response was no surprise to market watchers: Government shutdowns may be dramatic, but they haven’t been a major headwinds for the stock market—particularly recently, with the last time the S&P 500 declined during one coming in 1990.\n\nOver the past 50 years, the average S&P 500 return during a government shutdown has been a decline of 1.6%, according to Adam Turnquist, chief technical strategist for LPL Financial. The worst shutdown for stocks was in 1979, when the S&P 500 lost more than 6%.\n\nThe most recent shutdown, which lasted from Dec. 22, 2018, to Jan. 25, 2019, was the longest in history. The S&P 500 rose more than 10% in that period as investors looked past the noise of the shutdown and focused on the Federal Reserve’s pivot to more dovish policy after raising interest rates four times in 2018.\n\n“Investors have generally looked past budget-related disruptions, prioritizing corporate earnings, broader economic trends, and other key macroeconomic factors,” Turnquist said."
  },
  {
    "title": "Government Shutdown, Government Shmutdown - Nasdaq",
    "source": "Nasdaq",
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTE9HWTJFMUN2Umx2U1Z0S2FlVTRPU25pX2xzTXJQQkhpNm1Del91NFRlN3ZrM2l5WHNMQ2RHX1B4dXotelU2RU9zdHdBUUlzSXp5NlZadW5pSGtJOWRtbXhRZ3NBdnFJTkJJbkp6ZEdMcVJyTERsRURRSktzS1I?oc=5",
    "published_date": "2025-10-01 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9HWTJFMUN2Umx2U1Z0S2FlVTRPU25pX2xzTXJQQkhpNm1Del91NFRlN3ZrM2l5WHNMQ2RHX1B4dXotelU2RU9zdHdBUUlzSXp5NlZadW5pSGtJOWRtbXhRZ3NBdnFJTkJJbkp6ZEdMcVJyTERsRURRSktzS1I?oc=5\" target=\"_blank\">Government Shutdown, Government Shmutdown</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Nasdaq</font>",
    "content": "Market indexes were ultimately unbothered by this latest federal government shutdown today, to say nothing of the negative private-sector payroll report this morning from ADP ADP. The AI tech trade is proving too powerful for naysayers — yesterday NVIDIA NVDA became the first company to amass a $4.5 trillion market cap, and the stock rose again today. Tesla TSLA deliveries are expected to be the best of the year, with the expiration of the EV tax credit due.\n\nAs good as any stock you can name, gold is also hitting record highs today: $3895 per troy ounce amounts to a +45% gain year to date. This can be seen as a hedge against things like the government shutdown, should it cause unforeseen problems. Gold prices had been as high as $3915 per troy ounce during the course of the trading day.\n\nThe Dow gained +43 points today, a mere +0.09%, and the S&P 500 crossed 6700 for the first time ever as of a session close, +22 points or +0.34%. The Nasdaq had the best day of the top indexes, +95 points or +0.42% today and setting a new high of 22,755 as of the closing bell. The small-cap Russell 2000 is still off its September 18th all-time highs, but gained +5 points, +0.24%.\n\nManufacturing Data Basically In-Line\n\nAside from the -32K private-sector jobs created last month as per ADP, both ISM Manufacturing and final S&P Manufacturing PMI numbers for September came in pretty much as expected: ISM came in 10 basis points (bps) above projections to +49.1%, up 40 bps from the August headline. S&P was steady at +52.0, the same as the prior month and as analysts expected.\n\nConstruction spending data for August was delayed today, due to the federal shutdown. Analysts have forecast a drop to -0.2% for the month, down from -0.1% the previous month.\n\nWhat to Expect from the Stock Market Thursday\n\nSuccinctly put: not much. We won’t be seeing any Weekly Jobless Claims numbers tomorrow morning, as they are supplied by the U.S. Department of Labor, which is closed currently — and for who knows how long. Factory Orders for August are put together by the U.S. Census Bureau, so don’t expect them either.\n\nHow long can the stock market float above the rigors of the economy, especially considering we have clear signs of an unraveling labor force? For now, the momentum from the AI trade — among other things: Pfizer PFE shares were up following a sweetheart deal made with the President of the United States — is proving to be the supreme market catalyst.\n\nQuestions or comments about this article and/or author? Click here>>\n\nBeyond Nvidia: AI's Second Wave Is Here\n\nThe AI revolution has already minted millionaires. But the stocks everyone knows about aren't likely to keep delivering the biggest profits. Little-known AI firms tackling the world's biggest problems may be more lucrative in the coming months and years."
  },
  {
    "title": "Stock Futures Mixed As Government Shutdown Enters 10th Day: APLD, NVDA, AMD, QCOM Among Stocks To Watch - Stocktwits",
    "source": "Stocktwits",
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQYkUzV09BU3VkcV9aTnNPWE54SGt5Rkl3NjMwR2laWUdkbk95QjhvLVl2QlJ1WVhmTVFCZGVxQmwwR2wxcG54TnZZeXN6VFJDUkxWaE11bnphUDg0SmVXS0VvRVVmMThqYl95UkwtaXJyMFE4Vk9Ib2V6ekNMbnUtMG5PTkc1ZUJEZzUyM2tOT3VzQ3RnQmVrNlh6ckp5QWJhcnVKOFBLaDUyVnUyZG5BWkExMVBQRGl4Vm1xb2xJcFZKYmJp?oc=5",
    "published_date": "2025-10-10 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMixAFBVV95cUxQYkUzV09BU3VkcV9aTnNPWE54SGt5Rkl3NjMwR2laWUdkbk95QjhvLVl2QlJ1WVhmTVFCZGVxQmwwR2wxcG54TnZZeXN6VFJDUkxWaE11bnphUDg0SmVXS0VvRVVmMThqYl95UkwtaXJyMFE4Vk9Ib2V6ekNMbnUtMG5PTkc1ZUJEZzUyM2tOT3VzQ3RnQmVrNlh6ckp5QWJhcnVKOFBLaDUyVnUyZG5BWkExMVBQRGl4Vm1xb2xJcFZKYmJp?oc=5\" target=\"_blank\">Stock Futures Mixed As Government Shutdown Enters 10th Day: APLD, NVDA, AMD, QCOM Among Stocks To Watch</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Stocktwits</font>",
    "content": "Equity\n\nStock Futures Mixed As Government Shutdown Enters 10th Day: APLD, NVDA, AMD, QCOM Among Stocks To Watch\n\nStock Futures Mixed As Government Shutdown Enters 10th Day: APLD, NVDA, AMD, QCOM Among Stocks To Watch\n\nWhile Dow Jones futures edged up by 0.02% at the time of writing, the S&P 500 futures were down by 0.03%.\n\nPeople walk by the New York Stock Exchange\n\nPeople walk by the New York Stock Exchange. (Photo by Spencer Platt/Getty Images)\n\nProfile Image\n\nRounak Jain·Stocktwits\n\nUpdated Oct 10, 2025 | 10:32 AM EDT\n\nShare\n\n·\n\nAdd us onAdd us on Google\n\nSPYSPY\n\n0.19%\n\nQQQQQQ\n\n0.50%\n\nDIADIA\n\n0.60%\n\nSPXSPX\n\n0.05%\n\nU.S. stocks appear set for a cautious opening on Friday, with investors exercising caution as the United States government shutdown entered its 10th day.\n\nTreasury Secretary Scott Bessent has reportedly narrowed down the list of Federal Reserve Chair candidates to five from 11. The list includes Fed Vice Chair for Supervision Michelle Bowman and Fed Governor Christopher Waller, National Economic Council director Kevin Hassett, former Fed Governor Kevin Warsh, and BlackRock Fixed Income CIO Rick Rieder.\n\nWhile Dow Jones futures edged up by 0.02% at the time of writing, the S&P 500 futures were down by 0.03%, while the tech-heavy Nasdaq 100’s futures fell 0.02%. Futures of the Russell 2000 index were down by 0.04%.\n\nRead Next\n\nMichael Burry Digs Up ‘One Chart To Refute Them All’ As He Sounds Fresh AI Bubble Alarm\n\nShanthi M·33m ago\n\nMichael Burry attends \"The Big Short\" New York premiere at Ziegfeld Theater on November 23, 2015 in New York City.\n\nMeanwhile, the SPDR S&P 500 ETF (SPY) was up by 0.15% at the time of writing, Invesco QQQ Trust (QQQ) gained 0.16% on Friday morning, and SPDR Dow Jones Industrial Average ETF Trust (DIA) rose 0.16%. Retail sentiment around the S&P 500 ETF on Stocktwits was in the ‘bearish’ territory.\n\nAsian markets ended Friday’s trading session on a largely negative note, with the Hang Seng index declining the most at 1.76%, followed by the Shanghai Composite at 0.95%, and the Nikkei 225 at 0.88%.\n\nThe KOSPI gained 1.7%, while the TWSE Capitalization Weighted Stock index was closed for trading on account of National Day.\n\nStocks To Watch\n\nApplied Digital Corp. (APLD): Applied Digital shares skyrocketed 26% in Friday’s pre-market trade after the company’s first-quarter (Q1) results beat Wall Street expectations. The company reported a loss of $0.03 per share on revenue of $64 million, beating an estimated loss of $0.13 per share on revenue of $50 million, according to Stocktwits data.\n\nNvidia Corp. (NVDA), Advanced Micro Devices Inc. (AMD): The Senate late Thursday passed legislation to prioritize access to AI chips to U.S. companies ahead of their Chinese counterparts. Nvidia shares edged 0.7% higher, while AMD shares declined 0.5% in Friday’s pre-market session.\n\nQualcomm Inc. (QCOM): Qualcomm is under an antimonopoly probe by Chinese regulators over its acquisition of Israel-based Autotalks. Qualcomm shares were down over 1% pre-market.\n\nVenture Global Inc. (VG): Venture Global shares plunged over 18% pre-market after the company lost an arbitration case against BP Plc. (BP)."
  },
  {
    "title": "Stock Market News From Oct. 1, 2025: S&P 500 Notches Record - Barron's",
    "source": "Barron's",
    "url": "https://news.google.com/rss/articles/CBMi-wJBVV95cUxQejNrUVdENllseFZJRHhWUWRQR0QxV1pDN0NjMnRKa0t1THpsX3B4dWllNlVJbk84Wk1oNnJNNzFVWUhMVWkwLW5KTGFvWHhYSlMxQmJtU2hWbTduQ2xuM21OR1MzMVp4VW55YWJtYklOTzR5ck5GY1dsdm5kNGpCRVdPd3RXcW1nMUpTZ2dRRDd2VUV5aVpnZ2VzRnQyRDNfLWVwTUFVVDBKbHJzU1RQZ1lOUjRGUWZRaFVEcHgzeWJBN180YjExT0JGTnE5Rm96QzJYNlR5SUM3V1lRTFVQdlVhdVlDdHppUnBIc3JUYnc4bjZ6X2ZTWnFKb3VmNnBfQVZLUGI1VmM5aWZaX0U0a0t2ZWwyLWFvTTdWZ3hYdG9tSlEwdkZreWx4V3ZiX01qbjUyVW5yMnBBUDRFR1N6blBCTjh4X2hfaFBLWUNkS3ZIZ0trN2xDc0xDUVdaM0J0WUU1dzA5cHY5NUxSWkd0b1NvUUhqV1pLVDdN?oc=5",
    "published_date": "2025-10-01 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi-wJBVV95cUxQejNrUVdENllseFZJRHhWUWRQR0QxV1pDN0NjMnRKa0t1THpsX3B4dWllNlVJbk84Wk1oNnJNNzFVWUhMVWkwLW5KTGFvWHhYSlMxQmJtU2hWbTduQ2xuM21OR1MzMVp4VW55YWJtYklOTzR5ck5GY1dsdm5kNGpCRVdPd3RXcW1nMUpTZ2dRRDd2VUV5aVpnZ2VzRnQyRDNfLWVwTUFVVDBKbHJzU1RQZ1lOUjRGUWZRaFVEcHgzeWJBN180YjExT0JGTnE5Rm96QzJYNlR5SUM3V1lRTFVQdlVhdVlDdHppUnBIc3JUYnc4bjZ6X2ZTWnFKb3VmNnBfQVZLUGI1VmM5aWZaX0U0a0t2ZWwyLWFvTTdWZ3hYdG9tSlEwdkZreWx4V3ZiX01qbjUyVW5yMnBBUDRFR1N6blBCTjh4X2hfaFBLWUNkS3ZIZ0trN2xDc0xDUVdaM0J0WUU1dzA5cHY5NUxSWkd0b1NvUUhqV1pLVDdN?oc=5\" target=\"_blank\">Stock Market News From Oct. 1, 2025: S&amp;P 500 Notches Record</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Barron's</font>",
    "content": "Key Events\n\n2 months ago\n\nThe S&P 500 Hits a Record Despite Bad Breadth\n\n2 months ago\n\nStocks Turn Higher. The S&P 500 Is on Track for a Record Close.\n\n2 months ago\n\nU.S. Manufacturing Activity Remains Weak, ISM Data Show. Tariffs Are to Blame.\n\n2 months ago\n\nStocks Fall as Labor Market Shows More Signs of Weakening\n\n2 months ago\n\nOctober Rate-Cut Odds Hit 100% After Weak ADP Report\n\n2 months ago\n\nTreasury Yields Slide, Stock Futures Hold Lower After ADP Report\n\n2 months ago\n\nDollar Falls as Markets Digest Political Deadlock\n\n2 months ago\n\nGold Hits Another Record as Uncertainty Builds\n\n2 months ago\n\nWall Street's Fear Index Jumps. Why Investors Are on Edge.\n\n2 months ago\n\nStock Futures Tumble as Government Shutdown Starts\n\nPinned Post\n\n2 months ago\n\nS&P 500 Cuts Through Shutdown Noise to Hit Fresh Highs\n\nBy\n\nConnor Smith\n\nThe stock market was back at record levels on Wednesday as Wall Street shrugged off the government shutdown and some weak private sector jobs data.\n\nThe S&P 500 rallied 0.3% after opening lower to hit its 29th record close of 2025. The Dow Jones Industrial Average rose 43 points, or 0.1%, to set a fresh closing high. The Nasdaq Composite rose 0.4% to move back within striking distance of its Sept. 22 closing high.\n\nLatest Updates\n\n2 months ago\n\nThe S&P 500 Hits a Record Despite Bad Breadth\n\nBy\n\nConnor Smith\n\nThe S&P 500 set a fresh intraday record on Wednesday even though a majority of the stocks in the index were down.\n\nThe market benchmark was up 0.2% and trading north of 6700 for the first time even though 301 stocks in the index were down. The Dow was up 23 points, or 0.1%, and on track for a closing high. The Nasdaq Composite was up 0.4% and gaining ground on its Sept. 22 record close.\n\nUpdated 2 months ago\n\nThese Stocks Are Today's Movers: Nike, Netflix, Fermi, Ford, Moderna, AES, Lithium Americas, Sunrun\n\nThese Stocks Are Today's Movers: Nike, Netflix, Fermi, Ford, Moderna, AES, Lithium Americas, Sunrun\n\nNike rises after the sneaker and athletic apparel company’s quarterly earnings beat Wall Street estimates.\n\nRead the full article\n\nUpdated 2 months ago\n\nStocks Turn Higher. The S&P 500 Is on Track for a Record Close.\n\nBy\n\nConnor Smith\n\nThe stock market was back on record watch as Wall Street shrugged off the government shutdown.\n\nThe Dow was up 105 points, or 0.2%, after trading lower earlier in the morning. Any move higher would be a fresh record. The S&P 500 was up 0.1% and hovering right around its Sept. 22 closing high. The Nasdaq Composite was up 0.1%."
  },
  {
    "title": "US stocks tick toward records as the AI frenzy keeps leading the way; OpenAI announces multi-billion dollar partnership with AMD - ABC7 Los Angeles",
    "source": "ABC7 Los Angeles",
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxOOGZFWkJWNUctUUZlU2JFZ3Y5VFZUY2hyR01ucmd6MEtuRU5UWFJzVmUybWJXemFvMVl1aVdDNnRNLXpVUjB1RnJEbkdvQ0dRYXYzVGNGRXNHRmxGVF95cWpuUEZOSU5fbVBmYzZBenBwUWQwQkRheFd0SEdjVG14SkNhMGFLMTBMalE2WlhGZlV2R2F5cjRDR0wyZGp4ZUN4Vy1UTFNMcUV6VEtWZDJkR1RDRXpoRkk4ekNnanNiV3jSAcYBQVVfeXFMTUJ5SkRfdVBVU0lGUUltWEo2dXBKSDFJV0xNWEkxTUgtZWtaM1EyUXZUa0xEM0NCMXBzcVRVTU1wcGZFTmd4VTAxZm5sMzNZYTduQktLZ1NVMHVaZ2xkZ2lKcncwUXMxR0ZSSWx6T2F2Qm5KTDVqUW9DYXFPVzc4cjB1ZnFjcHA0VVVrSENreWs3Zjc5dFk4am1JR1VZdndIYnI2QlZIRTFZbmlVUkowVDhSeVFXeFdEYU9MdC1oY21iV2hRZUNB?oc=5",
    "published_date": "2025-10-06 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiwAFBVV95cUxOOGZFWkJWNUctUUZlU2JFZ3Y5VFZUY2hyR01ucmd6MEtuRU5UWFJzVmUybWJXemFvMVl1aVdDNnRNLXpVUjB1RnJEbkdvQ0dRYXYzVGNGRXNHRmxGVF95cWpuUEZOSU5fbVBmYzZBenBwUWQwQkRheFd0SEdjVG14SkNhMGFLMTBMalE2WlhGZlV2R2F5cjRDR0wyZGp4ZUN4Vy1UTFNMcUV6VEtWZDJkR1RDRXpoRkk4ekNnanNiV3jSAcYBQVVfeXFMTUJ5SkRfdVBVU0lGUUltWEo2dXBKSDFJV0xNWEkxTUgtZWtaM1EyUXZUa0xEM0NCMXBzcVRVTU1wcGZFTmd4VTAxZm5sMzNZYTduQktLZ1NVMHVaZ2xkZ2lKcncwUXMxR0ZSSWx6T2F2Qm5KTDVqUW9DYXFPVzc4cjB1ZnFjcHA0VVVrSENreWs3Zjc5dFk4am1JR1VZdndIYnI2QlZIRTFZbmlVUkowVDhSeVFXeFdEYU9MdC1oY21iV2hRZUNB?oc=5\" target=\"_blank\">US stocks tick toward records as the AI frenzy keeps leading the way; OpenAI announces multi-billion dollar partnership with AMD</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">ABC7 Los Angeles</font>",
    "content": "NEW YORK -- Wall Street keeps setting more records, and excitement about the artificial-intelligence industry keeps leading the way.\n\nThe S&P 500 climbed 0.4% to set an all-time high following mixed trading on Monday. The Dow Jones Industrial Average dipped 63 points, or 0.1%, while the Nasdaq composite rose 0.7% to its own record.\n\nAdvanced Micro Devices helped lead the way and soared 23.7% after announcing a deal where OpenAI will use its chips to power AI infrastructure. As part of the deal, OpenAI could own up to 160 million shares of AMD if it hits certain milestones.\n\nA frenzy around AI has been one of the main reasons Wall Street has been hitting record after record, though that's also raising worries that prices have potentially shot too high. Much of the furor around AI in the last couple weeks has come from OpenAI, which has quickly grown into a $500 billion company. It's been announcing deals with businesses around the world to develop more AI infrastructure.\n\nAnother chip company, Nvidia, announced a deal last month where it would invest $100 billion in OpenAI as part of a partnership, creating criticism that the AI investment pipeline was beginning to appear like a circle. Nvidia slipped 1.1% following the AMD announcement. Because it's the most valuable stock on Wall Street, Nvidia was the heaviest weight on the S&P 500.\n\nOutside of tech, Comerica jumped 13.7% after Fifth Third Bancorp agreed to buy it in an all-stock deal valued at $10.9 billion. The combination would create the country's ninth-largest bank. Fifth Third's stock fell 1.4%.\n\nTesla rose 5.4% after social-media postings by the electric-vehicle maker hinted at a possible product unveiling coming on Tuesday.\n\nVerizon Communications fell 5.1% after the telecom replaced its chief executive. Dan Schulman, a director at the company and former CEO of PayPal, is taking over for Hans Vestburg.\n\nElsewhere on Wall Street, trading was relatively quiet as the stock market continues to largely ignore the U.S. government's shutdown. Past closures of the federal government have had minimal effect on the stock market or on the economy, and the bet on Wall Street is that something similar will happen again.\n\nAll told, the S&P 500 rose 24.49 points to 6,740.28. The Dow Jones Industrial Average fell 63.31 to 46,694.97, and the Nasdaq composite rose 161.16 to 22,941.67.\n\nPolitics are playing a bigger role in stock markets abroad, as Japanese stocks soared and French stocks slumped following their latest political shake-ups.\n\nJapan's Nikkei 225 jumped 4.8% after the country's Liberal Democratic Party chose Sanae Takaichi as its leader. She was an ally of the late Prime Minister Shinzo Abe, who pushed for lower interest rates and other policies that investors liked.\n\nThe yen's value dropped against the U.S. dollar on expectations that Takaichi will boost spending, likely adding to inflationary pressures. That in turn helped push up stocks of Japanese exporters, whose products can become more attractive on the global market when the yen is cheaper.",
    "far,": "eil Newman, head of strategy at Astris Advisory Japan, said about Takaichi.\n\nIn Paris, the CAC 40 index slumped 1.4% following the resignation of France's new prime minister.\n\nSébastien Lecornu resigned a day after he named his government, drawing a backlash across the political spectrum for his choice of ministers. French politics have been in disarray since President Emmanuel Macron called snap elections last year that produced a deeply fragmented legislature.\n\nIn the bond market, the yield on the 10-year Treasury rose to 4.16% from 4.13% late Friday.\n\nThe shutdown of the U.S. government likely means delays for U.S. economic reports scheduled for this week, though investors will have some earnings reports to comb through, including from Delta Air Lines, PepsiCo and Levi Strauss.\n\nDespite the shutdown, the Federal Reserve will release minutes from its meeting last month, when it cut its benchmark interest rate for the first time this year. Much on Wall Street is riding on expectations that the Fed will continue cutting interest rates through this year and into next."
  },
  {
    "title": "S&P 500, Nasdaq close at record highs as Wall Street looks past U.S. government shutdown - CNBC",
    "source": "CNBC",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFBhdGZsWjJubHR2MkJiZDRKTWZuSGtEbDhxRjBsREg4dUxmaFpuZm1fTllKeGVpVXIzakxjZE9WQ2dPdDZhdV9Zc2pYNUFRQVVnVmpkQnVjUktlbk9qTkpRckgzQW5oaEhVV0RDdWhDaW1CeVBURE9R0gF8QVVfeXFMUGFyNVBaUS1jQ1RkNDh0blktN2wwQXZYMnVWRUM4T1NuTm9rZUhEZnBGYm9SV19jcjcyUk9EQnBBY3NmbjR1LWlNbVprWlJEV2JnN2paNVdRRTEzb3BfZENoT2hhVm5jYTdKaTFtc0R0aEhhMlREYjNLMjVhWQ?oc=5",
    "published_date": "2025-10-07 22:04:05",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFBhdGZsWjJubHR2MkJiZDRKTWZuSGtEbDhxRjBsREg4dUxmaFpuZm1fTllKeGVpVXIzakxjZE9WQ2dPdDZhdV9Zc2pYNUFRQVVnVmpkQnVjUktlbk9qTkpRckgzQW5oaEhVV0RDdWhDaW1CeVBURE9R0gF8QVVfeXFMUGFyNVBaUS1jQ1RkNDh0blktN2wwQXZYMnVWRUM4T1NuTm9rZUhEZnBGYm9SV19jcjcyUk9EQnBBY3NmbjR1LWlNbVprWlJEV2JnN2paNVdRRTEzb3BfZENoT2hhVm5jYTdKaTFtc0R0aEhhMlREYjNLMjVhWQ?oc=5\" target=\"_blank\">S&amp;P 500, Nasdaq close at record highs as Wall Street looks past U.S. government shutdown</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "content": "The S&P 500 and Nasdaq Composite scored new all-time intraday and closing highs on Wednesday, a day after the broad market index snapped a seven-day winning streak because of a drop in Oracle\n\nthat called to question the sustainability of the artificial intelligence trade. The U.S. government shutdown is also in its second week.\n\nThe benchmark S&P 500 climbed 0.58% to close at 6,753.72, supported by a rise in the index’s information technology, utilities and industrials sectors. All three sectors notched fresh closing highs. The Nasdaq Composite\n\nadvanced 1.12% to finish at 23,043.38. The Dow Jones Industrial Average\n\nfell 1.20 points to end the day at 46,601.78.\n\nStocks showed little reaction to the release of minutes from the Federal Reserve’s September meeting, where it cut rates for the first time in 2025. The minutes showed a Fed divided over how much further to cut rates.\n\nNvidia\n\nshares rose 2% after CEO Jensen Huang said that demand has risen in recent months, telling CNBC that “this year, particularly the last six months, demand of computing has gone up substantially.” Huang also confirmed the company’s involvement in funding Elon Musk’s artificial intelligence startup, xAI, and said that he’s “super excited about the financing opportunity they’re doing.”\n\n“We know some of the things AI can do. We can all be impressed with some of the capabilities, but at the end of the day, there needs to be demand for the chips, demand for whatever the software layer that’s built on top of all that compute looks like,” Baird investment strategist Ross Mayfield said to CNBC. “The demand still being there – and Nvidia is obviously in the best position in the world to comment on that – I do think is reassuring that the level of spending capex isn’t completely circular.”\n\nThe move comes just a day after the AI chip darling finished lower in sympathy with Oracle shares after a report that Oracle was seeing lighter margins in its cloud business than analysts were forecasting. The report also claimed the company is losing money on some of its deals to rent out Nvidia’s chips.\n\nThat added to fears that the stock market is caught up in an AI bubble that harkens back to the late 1990s, when a feeding frenzy on early internet companies eventually led to the bursting of the dot-com bubble. Many market observers are urging investors to rebalance their portfolios, while also acknowledging there could be further upside before the AI rally exhausts itself.\n\n“Even if you look at the late-’90s, we had big corrections in the Nasdaq every single year, so I think there’s going to continue to be this enthusiasm for a sell-off in tech stocks,” Mayfield said. “There could be several corrections, big corrections in tech stocks, you know DeepSeek-type moments, before we ultimately get to some sort of bull market top. I just don’t really feel that we’re close there.”\n\nMeanwhile, the current government shutdown dragged into its eighth day Wednesday, with the Senate once again rejecting dueling stopgap funding bills. The vote marks the sixth time the chamber was unable to advance legislation to reopen the government.\n\nThe stoppage has weighed little on equities thus far, but poses a greater risk to sentiment the longer it wears on, given the potential hits to the U.S. economy. President Donald Trump has suggested that not all federal workers who have been furloughed will receive back pay, saying Tuesday that “it depends on who we’re talking about.” Active-duty military members might also miss a paycheck scheduled for Oct. 15."
  },
  {
    "title": "Trump's Stock Market Grab: What It Means For Nvidia, Intel And The U.S. Economy - Investor's Business Daily",
    "source": "Investor's Business Daily",
    "url": "https://news.google.com/rss/articles/CBMilwFBVV95cUxQUWphbm41Uld0VWNhcjI3XzhtRUFGT3oxazlMdTNNS0NfZ3JCTEpVNmRqLWNfR0dpY0drRTM4cWZUeVVuaUp0M1AzSWVUQ0xzVFZqYmhyVE1KcGhBc2p4cE5nYW9qX25GS0VFenVhTmJoQUpJYzBKZ2dobDZyaW1ZM1dVeWR3VllXbVF3bWJ3SjBqR3ZRekVz?oc=5",
    "published_date": "2025-10-13 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQUWphbm41Uld0VWNhcjI3XzhtRUFGT3oxazlMdTNNS0NfZ3JCTEpVNmRqLWNfR0dpY0drRTM4cWZUeVVuaUp0M1AzSWVUQ0xzVFZqYmhyVE1KcGhBc2p4cE5nYW9qX25GS0VFenVhTmJoQUpJYzBKZ2dobDZyaW1ZM1dVeWR3VllXbVF3bWJ3SjBqR3ZRekVz?oc=5\" target=\"_blank\">Trump's Stock Market Grab: What It Means For Nvidia, Intel And The U.S. Economy</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor's Business Daily</font>",
    "content": "Following the money — federal government largesse — is a well-traveled path on Wall Street. But President Donald Trump has added a twist — following the golden shares, or new equity stakes that give the government a special interest in companies' fates.\n\nStock market investors have bid up Intel (INTC), MP Materials (MP) and the entire U.S. steel sector after Trump leveraged U.S. government support to pry away significant equity stakes or effective veto power. Trump's readiness to intervene on behalf of chosen companies, even at the cost of competitors and customers, clashes with traditional Republican views that the economy thrives when the government stays out of the way of markets.\n\n↑\n\nNOW PLAYING\n\nThe U.S. Now Owns 10% Of Intel. What That Means For America’s Chip Supply.\n\nLike it or not, a brash new Trump economy is ringing in elements of state capitalism. Building on the sweeping Trump tariffs, the White House is pushing into previously out-of-bounds business activity, from a golden share in U.S. Steel to taking a cut of the proceeds from Nvidia (NVDA) and AMD (AMD) AI chip sales to China.\n\nThose moves are unprecedented",
    "reflect the administration's increasingly transactional approach to corporate America — an approach that challenges the foundations of the traditionally market-oriented U.S. system.": "xtraordinary interventions may be warranted when there's a strategic necessity. Factories seizing up after Beijing froze rare earth magnet exports surely cleared the bar. Efforts to keep the last advanced U.S. chipmaker from going fabless may be defensible.\n\nYet the Trump economy's state capitalism may be a slippery slope. Favored firms and their stocks may thrive, but competition and the U.S. economy could suffer long term.\nControlling Stock Market Stakes\n\nThe U.S. only holds an actual",
    "share": "f U.S. Steel, which can't be sold on the stock market and has no financial value. But its position as top shareholder and most important benefactor gives it equivalent control over Intel and MP Materials.\n\nThe golden share gives Trump a veto over Nippon Steel's newly acquired U.S. operations. So he never has to worry about getting burned by a plant closure or layoffs. Trump already exercised that power in September to keep a U.S. Steel plant in Illinois operating.\n\nTrump also pushed Nippon to invest $14 billion to upgrade U.S. Steel plants and build a new one, spending $11 billion by 2028.\n\nThe onerous terms were to compensate for national security concerns,",
    "exist": "iven that Japan is a close ally. That's according to Stephen Heifetz, partner at the law firm Wilson Sonsini Goodrich & Rosati, in a Council on Foreign Relations piece. This",
    "market.": "rump Tariffs Part Of State Capitalism\n\nNippon Steel might have balked, but Trump threw in a clincher — doubling the tariff on steel imports to 50%.",
    "that,": "rump assured steelworkers while celebrating the deal's closure at a May 30 rally.\n\nThe U.S. government doesn't have a direct financial stake in Nippon or even its U.S. operations. But Trump put his credibility on the line in the deal, backed by a high wall of protectionism. That helped ignite U.S. steel stocks. Beaten-down shares of Cleveland-Cliffs (CLF) have more than doubled. S&P 500 members Nucor (NUE) and Steel Dynamics (STLD) have climbed by 26% and 19%, respectively, since May 30.",
    "market,": "leveland-Cliffs CEO Lourenco Goncalves said on July 21. He made it clear that his company would entertain any offers.\n\nSteel tariffs hike costs for automakers and many other manufacturers. That complicates the Trump economy's goal of boosting U.S. factory activity.\nMP Materials, Intel Soar On U.S. Equity Stakes\n\nMP Materials, which operates the world's second-largest rare earths mine in Mountain Pass, Calif., has more than tripled since the Department of Defense put up $400 million to become the largest shareholder, with a 15% stake. The latest gains follow China's expansion of rare-earth export restrictions, including a ban for military applications. Intel has surged 67% since news broke on Aug. 14 that the White House was in talks to convert CHIPS Act funding of the embattled chipmaker into an equity stake.\n\nThe story appears much the same at Lithium Americas, whose Thacker Pass project in Nevada is one of the world's largest-known lithium deposits. Lithium Americas stock has soared 172% since news emerged on Sept. 24 that the Trump administration might take an ownership stake. Confirmation came on Sept. 30.\n\nThe explosive stock market impact of Trump's equity investments has propelled shares of other small mining stocks, even though analysts questioned whether the actual terms of the investment were all that beneficial.\n\nLithium Americas gets to defer payment on a $2 billion loan approved by the Biden administration. In return, the federal government gets a 5% stake in the Thacker Pass project and 5% stake in Lithium Americas. The U.S. stake may slightly de-risk the project, but it doesn't significantly change its economics and comes at a high cost to shareholders.\nTrump's Stock Market Winners\nCompany \tTicker \tInitial Report \tPrior Closing Price \tPrice On Oct. 13 \t% Change\nNucor \tNUE \tMay 30 \t109.36 \t138.33 \t26%\nSteel Dynamics \tSTLD \tMay 30 \t123.07 \t146.25 \t19%\nCleveland-Cliffs \tCLF \tMay 30 \t5.83 \t13.85 \t138%\nMP Materials \tMP \tJuly 9 \t30.03 \t95.89 \t219%\nIntel \tINTC \tAug. 13 \t22.22 \t37.19 \t67%\nLithium Americas \tLAC \tSept. 23 \t3.07 \t8.34 \t172%\nTrilogy Metals \tTMQ \tOct. 6 \t2.09 \t6.66 \t216%\n\nCanada's Trilogy Metals (TMQ) tripled on Tuesday after the White House said it's making a $35.6 million investment for a 10% stake and warrants to receive another 7.5%. The funds will support development of a copper mine in northwest Alaska. Trump also authorized a road that will make the mine accessible.\n\nPrior administrations stuck to grants or loans. Yet Intel and, to a lesser extent, MP Materials show that sometimes a full-fledged government embrace is required to rewrite a company's future.\n\nBack in 2022, the DOD awarded MP Materials $35 million to build a facility for processing heavy rare earth materials. So-called",
    "heavies": "eed into end products like samarium cobalt magnets that maintain their magnetic properties under temperatures high enough to liquefy lead. They're critical for military hardware like Lockheed Martin's F-35 and Tomahawk missiles, but the market isn't that big. MP Materials never built the plant because the Biden administration funded a second facility in Texas to be built by Australia's Lynas Rare Earths, which also ran into complications. That left China with a near monopoly.\nPentagon Commitment Spurs More MP Support\n\nMP Materials price floorThe Trump administration's MP equity investment is just one part of a transformative multibillion-dollar package.\n\nThe Pentagon also agreed to buy neodymium-praseodymium oxide (NdPr) from MP for the next decade at a floor price of $110 per kilogram. NdPr is a key compound in making permanent magnets for electric vehicles, wind turbines and robotics. The price had fallen to around half that level as China flooded the market. That made it hard for MP and other rare earth miners to compete, much less thrive.\n\nAs with the White House's Intel investment, the government's equity in MP Materials may be spurring other support. JPMorgan Chase (JPM) and Goldman Sachs (GS) put up $1 billion for MP Materials to build a second rare-earth magnet production facility. Apple (AAPL) committed $500 million to help MP launch a rare-earth metals recycling facility and reached a long-term supply agreement for 100% recycled rare earth magnets.\n\nAt the time, the Trump administration appeared to be picking one rare-earths winner. But USA Rare Earth (USAR) recently confirmed White House talks for a U.S. stake, sending shares soaring. USA Rare Earth is set to open a magnet production facility in Oklahoma in Q1 2026.\nTrump Stake Is Intel Inside\n\nBefore Trump's equity stake, Intel appeared to be hitting a wall, despite $10.9 billion awarded to the company by the Biden administration to ramp up advanced U.S. chip manufacturing. Over the summer, Intel stock neared a 12-year low. Analysts began to predict a move to a fabless model where Intel would contract out manufacturing after CEO Lip-Bu Tan said in July that Intel had invested too much",
    "confirmed customer commitments.\"\n\nBut then Tan expressed openness to converting $8.9 billion in yet-to-be released CHIPS Act funding into an equity stake.": "PAID ZERO FOR INTEL, IT IS WORTH APPROXIMATELY 11 BILLION DOLLARS,",
    "I will make deals like that for our Country all day long.": "e added:",
    "RICHER.": "he potential downside was that diluting Intel stock might make further stock market or private funding pricier and harder to come by. However, the opposite also may be true.\n\nAmid news reports that the White House and Intel were near a deal, Japan's SoftBank said on Aug. 18 that it had acquired a $2 billion Intel stake. Nvidia's $5 billion investment for a 4% stake followed one month later.\n\nIntel stock shot up 23% as Nvidia also announced it would become a big customer of Intel's x86 central processing units. Nvidia will use custom x86 chips for its own AI infrastructure platform for data centers. Still, Citi downgraded Intel shares to a sell a day later, saying the deal didn't resolve big concerns about its foundry business.\n\nAI Replacing Jobs? CEOs Sound The Alarm For White-Collar Workers\nWill Trump Mandate Intel Orders?\n\nAll of Nvidia's chips are made by Taiwan Semiconductor Manufacturing (TSM), which invented outsourced production for chip-design firms. There's no indication that's changing.",
    "TSMC,": "vidia CEO Jensen Huang said at the event announcing its deal with Intel.\n\nFor Intel to become a legitimate TSMC competitor, it must have the orders to prove it's up to the job. But why would Nvidia, Apple and others take the risk when they've got a good thing going?\n\nDan Kim, who served as chief economist for the CHIPS program office under President Biden, told Stratechery's Ben Thompson in a Sept. 11 interview that Intel's lack of orders is probably only resolvable with a government",
    "amount": "rom Intel, giving fabless chipmakers",
    "about what a government should do,\" Kim said. \"But we are now at a place where this particular administration's President doesn't really hold a lot of importance to previous norms and so is willing to break them for an outcome.": "n Kim's view, the upside would be worth it — not the equity upside of a rising Intel stock price, but the benefits of preserving Intel's research and development arm.",
    "controls.": "arket Dives, But Trump Says 'Don't Worry About China'\nNvidia's Jensen Huang Needs To Be On Trump's Good Side\n\nHuang insisted that the Trump administration played no part in Nvidia's investment in Intel. He touted the deal's benefits, including an expansion of Nvidia's market opportunity into laptops.\n\nEvery U.S. corporate titan has reason to get on Trump's good side, but Huang has more than just about anybody. In recent weeks, Nvidia has been hit by setbacks in China. Beijing blocked sales of its AI chips, including the H20 chip that Trump had let Nvidia export to China in return for a 15% revenue cut. Then, even as U.S.-China talks yielded TikTok progress, Beijing announced that Nvidia had violated anti-monopoly provisions.\n\nA grand U.S.-China bargain appears to be shaping up. Beijing is ready to permit the sale of TikTok's U.S. operations, which Trump has said is a priority. China may even be willing to give up its leverage over rare-earth magnets and restore unfettered exports. That is, if the price is right.\nAI Chip Export Controls\n\nYet the two sides may still be far apart on U.S. export controls over AI-related chips and chipmaking. Without a grand bargain, Nvidia could be out of luck in rebooting its H20 sales. Nvidia also is seeking approval to sell China a toned-down version of its new Blackwell chip.\n\nThe payoff that Trump sees as just desserts, others see as an unconstitutional export tax and a conflict of interest.",
    "capabilities,": "ep. John Moolenaar, R-Mich., said in an August statement.\n\nBut critics see the Biden administration's export controls on AI chips as self-defeating.\n\nChina is",
    "Why would we not allow (our technology) industry to go and compete for its survival": "including in China, the biggest market? Having the world",
    "technology": "ill maximize U.S. geopolitical influence, he said.\n\nYet allowing tech companies to compete — if they pay a tax — is less than optimal. Tax Policy Center fellow Howard Gleckman wrote that Trump's levy on Nvidia chip sales will",
    "Ad Hoc": "overeign Wealth Fund?\n\nsovereign wealth fundsTrump has favored the idea of a sovereign wealth fund. The fund could provide",
    "early-stage quantum companies, help national laboratories commercialize technologies, and ensure U.S. breakthroughs remain domestically controlled,": "ormer Intel CEO Pat Gelsinger wrote in a Wall Street Journal op-ed in July.\n\nCountries with large sovereign wealth funds, however, tend to be undemocratic, have vast state-owned oil-and-gas resources, or have large budget surpluses and foreign exchange reserves.\n\nThat's left Trump to try and come up with unorthodox funding sources. Along with turning CHIPS Act grants into equity, cashing in gold reserves has been floated. Trump's big play so far has been to twist trading partners' arms to put up investment funds — $550 billion from Japan and $350 billion from South Korea — or face higher auto tariffs. It's not clear how much money will materialize and how soon. Both Japan and South Korea have discussed providing loans or guarantees, rather than up-front cash.\n\nNorway's $2 trillion fund, most of which is invested in the global stock market, is legislatively grounded, Instead of a legislatively grounded, wrote Winston Ma, an adjunct professor at New York University School of Law who headed China Investment Corp.'s North America office. By contrast,, Trump",
    "sectors.": "tock Market Fuel Isn't Cost-Free\n\nThe full consequences of the sharp turn in economic policies may not be known for a long time, but policymakers across the political spectrum have concerns.\n\nTrump's recent corporate interventions",
    "gains,": "oel Dodge, director of industrial policy and economic security at the Vanderbilt Policy Accelerator, wrote in the Washington Monthly.\n\nYet if Congress fails to set ground rules for taking golden shares and revenue deals like the one with Nvidia — and there's no indication it will — it will be blessing",
    "cronyism, corruption, and favoritism for well-connected dominant firms.": "nvesting in the stock market alongside Trump has paid off when he's willing to use the full force of government to shift industry dynamics. Shares of MP Materials and Intel reflect that. Yet the Trump economy's push into state capitalism is just getting started, and there's reason to worry about where it could lead.",
    "scale,": "eronique de Rugy, senior fellow at George Mason University's Mercatus Center, wrote in a Los Angeles Times op-ed."
  },
  {
    "title": "Stock market today: Dow, S&P 500 notch records as Wall Street shrugs at shutdown, amps up rate cut bets - Yahoo Finance",
    "source": "Yahoo Finance",
    "url": "https://news.google.com/rss/articles/CBMi5AFBVV95cUxNOHRISDlfN25PRGEzTlFCVkZsdld4QXNKNHJLaE0yUU5SdVRZTGFkZDBFNjFjSmpoSmhXemZ2cjhVcnVkb0RzbDk0a25ESkJJenRrMFpRelZUNUhsdHRXaFQ0OEdkbThhQVJlUFdmcFA0SmdfalE2bjk5S0JGZkpNaGliM2lsNS1MS3d2N1RBaEtTTGZLOHhXMmY5cjVMSWFNXzE3Mmw0TEV2Uk45LVczVUJhd2RjNVN0NjMxS2JNd2I5cElOejloa2Zfal80eVVCQTl2aXVUSXE5dElkUDctbUhncm8?oc=5",
    "published_date": "2025-10-01 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi5AFBVV95cUxNOHRISDlfN25PRGEzTlFCVkZsdld4QXNKNHJLaE0yUU5SdVRZTGFkZDBFNjFjSmpoSmhXemZ2cjhVcnVkb0RzbDk0a25ESkJJenRrMFpRelZUNUhsdHRXaFQ0OEdkbThhQVJlUFdmcFA0SmdfalE2bjk5S0JGZkpNaGliM2lsNS1MS3d2N1RBaEtTTGZLOHhXMmY5cjVMSWFNXzE3Mmw0TEV2Uk45LVczVUJhd2RjNVN0NjMxS2JNd2I5cElOejloa2Zfal80eVVCQTl2aXVUSXE5dElkUDctbUhncm8?oc=5\" target=\"_blank\">Stock market today: Dow, S&amp;P 500 notch records as Wall Street shrugs at shutdown, amps up rate cut bets</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "content": "US stocks rose to fresh records on Wednesday after the US government entered its first shutdown in seven years. Investors turned their focus to weak ADP jobs data, which helped cement bets on near-term rate cuts.\n\nThe S&P 500 (^GSPC) advanced 0.3% to notch its first record close above 6,700. The Dow Jones Industrial Average (^DJI) gained nearly 0.1% to post its second consecutive record close. Meanwhile the tech-heavy Nasdaq Composite (^IXIC) increased 0.4%, erasing losses earlier in the session.\n\nDJI - Delayed Quote • USD\n\nDow Jones Industrial Average (^DJI)\n\n47,147.48\n\n-309.72\n\n(-0.65%)\n\nAt close: November 14 at 4:59:07 PM EST\n\n^DJI ^IXIC ^GSPC\n\nAdvanced Chart\n\nDate\n\nClose\n\nOpen\n\nHigh\n\nLow\n\nThe major gauges turned positive after a sluggish morning and after stocks closed out their strongest third quarter since 2020 on Tuesday.\n\nWall Street largely shrugged off the expected economic impact of the government shutdown, at least for now. The longer it lasts, the greater the likely hit to growth, as the fallout reaches the businesses that rely on the federal government's daily output.\n\nThe shutdown comes at a potentially perilous time for the economy, as the ADP's monthly employment report — in especially high focus Wednesday — showed private payrolls unexpectedly declined last month. The private sector lost 32,000 jobs, the report said, missing expectations for a gain of over 50,000.\n\nThat report likely spurred further bets on coming interest rate cuts from the Federal Reserve, however. Around 99% of bets are on a cut later this month, and expectations for a December cut — now at about 87% — also saw a big jump.\n\nIn Washington, agencies will now implement contingency plans and send hundreds of thousands of workers home, amid warnings from President Trump that \"a lot\" of firings are to come.\n\nMarkets are watching the developments closely. Among the agencies whose work is set to be frozen is the Bureau of Labor Statistics, which gathers and reports economic data key to Federal Reserve policy decisions.\n\nThe BLS was set to release the September jobs report on Friday. But the nonfarm payrolls update is likely to be delayed, as BLS plans to \"completely cease operations\" with just one full-time employee kept in post.\n\nThe shutdown isn't the only Trump policy push in focus on Wednesday, which marks the promised implementation of 100% tariffs on a range of pharmaceutical products and 25% duties on heavy-duty trucks."
  },
  {
    "title": "Markets News, Oct. 2: Stocks Rise for 5th Straight Session; Dow, S&P 500, Nasdaq Close at Record Highs - Investopedia",
    "source": "Investopedia",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBSMTBHanNjRldRTGkzODd0Z1VGRHZXYXBCb0RBYXgzVzBFSlBPdEwwSjMzdDZkcHFPQm5HOTU1dS1sOFdrVTdFVklyeHQyZjBha052eGZKa3FFY1F4blJ2NkJRQ19rWHhFU1BsUHZ3VQ?oc=5",
    "published_date": "2025-10-02 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTFBSMTBHanNjRldRTGkzODd0Z1VGRHZXYXBCb0RBYXgzVzBFSlBPdEwwSjMzdDZkcHFPQm5HOTU1dS1sOFdrVTdFVklyeHQyZjBha052eGZKa3FFY1F4blJ2NkJRQ19rWHhFU1BsUHZ3VQ?oc=5\" target=\"_blank\">Markets News, Oct. 2: Stocks Rise for 5th Straight Session; Dow, S&amp;P 500, Nasdaq Close at Record Highs</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>",
    "content": "Major stock indexes ended higher for a fifth straight session Thursday, the second day of the U.S. government shutdown, with the Dow Jones Industrial Average, S&P 500, and Nasdaq setting new closing records.\n\nThe tech-heavy Nasdaq, blue-chip Dow Jones Industrial Average, and benchmark S&P 500 finished up 0.4%, 0.2%, and 0.1%, respectively, with the Nasdaq and S&P 500 also hitting intraday records. It was the second day in a row that the Dow and S&P 500 set new closing marks.\n\nThe government shutdown that began Wednesday will delay the release of economic data, including Friday's key jobs report. The lack of data complicates decision-making for Federal Reserve officials, who meet later in the month to decide whether to lower interest rates, but investors largely shook off the shutdown.\n\nGold futures slipped 0.4% to about $3,880 an ounce at 4 p.m. ET after setting their latest record high of $3,923.30 earlier Thursday. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies, advanced 0.2% to 97.86.\n\nThe 10-year Treasury yield—which affects borrowing costs on all sorts of loans—ticked lower to 4.09% from 4.10% at Wednesday's close. Bitcoin advanced roughly 3% to about $120,900. West Texas Intermediate crude oil futures fell nearly 2% to $60.60 per barrel.\n\nChip shares rallied globally after OpenAI announced South Korean firms SK Hynix and Samsung would partner with the ChatGPT maker on its Stargate AI infrastructure project. SK Hynix and Samsung shares ended 10% and 3.5% higher, respectively, in Korean trading, while those of U.S. chipmakers Advanced Micro Devices (AMD), Broadcom (AVGO), and Nvidia (NVDA) advanced about 3.5%, 1.5%, and 1%, respectively.\n\nElsewhere, Tesla (TSLA) shares closed down 5% even though third-quarter deliveries figures came in better than expected; Stellantis (STLA) stock popped 8% as the Chrysler and Jeep parent posted a 6% rise in U.S. sales; and shares of data center developer Fermi (FRMI) reversed course and fell more than 11% after soaring 55% in their debut yesterday.\n\nAlso, shares of TransUnion (TRU) and Equifax (EFX) tumbled roughly 11% and 8.5%, respectively, after credit analytics firm Fair Isaac (FICO) announced new models that would bypass credit bureaus. Fair Isaac stock soared 18% in easily the top performance of S&P 500 stocks Thursday.\n\nOccidental Petroleum (OXY) stock erased premarket gains and fell 7% after Warren Buffett's Berkshire Hathaway (BRK.B) purchased its chemical business, OxyChem, for $9.7 billion in cash."
  },
  {
    "title": "Stock Market Today: Dow Advances Amid Shutdown Worries; Buffett Eyes Massive Deal (Live Coverage) - Investor's Business Daily",
    "source": "Investor's Business Daily",
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxNM21sbHBzOWNBaDFKUjdhM0xZY0dZOVJ4ckJmUFFlZnppTjhoeGg2dVhBMGZhQm40YmpsSTFHZ2lBRXVpRE5nNWhvYi05VXh3dEdTRnBfQndOUV9ocnVqMTd2bkRPRndKNkdQNnRvVjhCSjNRZ19oNXVsZE9PRllEN1JDMmFld3JKY2oxWTdmMTVEX0R4SGJHOVBoSmxnTkhCSEo4ckN4aHNJRFY4aFlmbWxiX04xV213d0ItYVVR?oc=5",
    "published_date": "2025-10-01 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMivgFBVV95cUxNM21sbHBzOWNBaDFKUjdhM0xZY0dZOVJ4ckJmUFFlZnppTjhoeGg2dVhBMGZhQm40YmpsSTFHZ2lBRXVpRE5nNWhvYi05VXh3dEdTRnBfQndOUV9ocnVqMTd2bkRPRndKNkdQNnRvVjhCSjNRZ19oNXVsZE9PRllEN1JDMmFld3JKY2oxWTdmMTVEX0R4SGJHOVBoSmxnTkhCSEo4ckN4aHNJRFY4aFlmbWxiX04xV213d0ItYVVR?oc=5\" target=\"_blank\">Stock Market Today: Dow Advances Amid Shutdown Worries; Buffett Eyes Massive Deal (Live Coverage)</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor's Business Daily</font>",
    "content": "Despite a government shutdown, the Dow Jones Industrial Average and S&P 500 finished the first day of the fourth quarter with record closes as a jobs report increased the odds increased for an interest-rate cut. Meanwhile, an artificial intelligence play soared in its trading debut, several gold stocks extended winnings and two Nasdaq 100 companies enjoyed double-digit gains on the stock market today.\n\nThe Dow rose 0.1% and notched a record close on Wednesday. Health care stocks fared well in the Dow on Wednesday, but finance and retail stocks lagged on the prospect of a drawn-out government work stoppage. JPMorgan Chase (JPM) and Goldman Sachs (GS) fell, as did Walmart (WMT) and Home Depot (HD). They all lost 1% or more.\n\n↑\n\nNOW PLAYING\n\nS&P 500 Hits High Despite Shutdown, Jobs Data; Vertiv, Snowflake, Reddit In Focus\n\nThe S&P 500 finished above the 6,700 threshold, also hitting a new all-time high, with a 0.3% rise. The tech-heavy Nasdaq composite advanced 0.4%. The small-cap Russell 2000 index reversed earlier losses and rose 0.2%.\n\nVolume on the New York Stock Exchange and on the Nasdaq was higher compared with the same time on Tuesday. Advancers outnumbered decliners on both exchanges — by nearly 3-to-2 on the NYSE and more than 4-to-3 on the Nasdaq.\n\nThe yield on the benchmark 10-year Treasury note fell five basis points to 4.10%. Crude oil fell to near $61.80 a barrel.\n\nEconomic reports due on Thursday and Friday may get delayed amid the government shutdown. The Commerce Department's factory orders report for August is due Thursday.\n\nBut the crucial jobs report for September is due Friday. Estimates for September payroll figures suggests that the economy added 50,000 jobs during the month while the unemployment rate held steady at 4.3%.\n\nMarkets Fare Well In Shutdowns",
    "well,": "aid Mark Malek, chief investment officer at Siebert Financial, in a note to clients on Wednesday.",
    "Still, if you look six months after each shutdown ended, the results have generally been positive. That said, there are some differences this time, such as the impact of furloughs and other factors.": "ollowing a weak ADP employment reading on Wednesday, traders pushed up odds to 99% for a 25-basis-point rate cut in October, up from 96.2% on Tuesday, according to the CME FedWatch Tool. That would come on top of a 25-basis-point cut in September. The Federal Reserve is due to meet Oct. 28-29.\n\nElsewhere, Nasdaq 100 players AstraZeneca (AZN) and Biogen (BIIB) gained 10% each. AstraZeneca climbed amid hopes that Pfizer's (PFE) pricing deal with the U.S. will pave the way for others to do the same.\n\nAnd Biogen continued to reap the rewards of the U.S. Food and Drug Administration's approval of its Alzheimer's treatment Leqembi, which Biogen coproduces with Eisai (ESAIY). Biogen stock climbed for the fourth straight session after receiving the FDA nod on Friday.\n3:20 p.m. ET\nStock Of The Day Rises On Analyst Upgrade\n\nIn stocks, Carvana (CVNA) rose after Jefferies raised its rating to buy from hold and increased the price target to 475 from 385, based on higher inventory and lower variable costs. Carvana stock approached a cup-with-handle buy point of 396.96.\n\nShares have gained 86% year to date, going by Tuesday's closing price. Carvana is Wednesday's IBD Stock Of The Day"
  },
  {
    "title": "Stock market today: S&P 500, Nasdaq notch record close as AMD's OpenAI deal sparks wild rally - Yahoo Finance",
    "source": "Yahoo Finance",
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxORWVoalFGckxDQTZFaE5LNVk3bmdKYWQzaEVFaUQydkZwMXYtYzJSWUQ1OV9CVERsdTFSN0htRjRBSy1SVjdyMmg4MVk5cl9seUNHbUtUWDlza3RuU0RCTjJ1R2QzVW9aYWlHNHM3bzVSUnpzWXh6cFZpUjVoaHYxVFZzYUY3RmZNc0ZyRkJFR1phTkpLd1JMWTRTS2pDRzdqYlJzZlFSRWxyTlBnSU9lLWluWlgwZjJtT0h5MGZDcXZpSmJuQUgxMklDN0RFaG04TUFucEFJWQ?oc=5",
    "published_date": "2025-10-06 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi1wFBVV95cUxORWVoalFGckxDQTZFaE5LNVk3bmdKYWQzaEVFaUQydkZwMXYtYzJSWUQ1OV9CVERsdTFSN0htRjRBSy1SVjdyMmg4MVk5cl9seUNHbUtUWDlza3RuU0RCTjJ1R2QzVW9aYWlHNHM3bzVSUnpzWXh6cFZpUjVoaHYxVFZzYUY3RmZNc0ZyRkJFR1phTkpLd1JMWTRTS2pDRzdqYlJzZlFSRWxyTlBnSU9lLWluWlgwZjJtT0h5MGZDcXZpSmJuQUgxMklDN0RFaG04TUFucEFJWQ?oc=5\" target=\"_blank\">Stock market today: S&amp;P 500, Nasdaq notch record close as AMD's OpenAI deal sparks wild rally</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "content": "US stocks mostly gained on Monday as the federal government shutdown entered another week, while a megadeal between AMD (AMD) and OpenAI (OPAI.PVT) lifted hopes for the AI trade.\n\nThe Nasdaq Composite (^IXIC) led the way higher, rising 0.7% to close at a fresh record high amid an over 23% rally from AMD. The S&P 500 (^GSPC) also gained 0.4% to notch an all-time high. The Dow Jones Industrial Average (^DJI), however, dropped 0.1%.\n\nNasdaq GIDS - Delayed Quote • USD\n\nNASDAQ Composite (^IXIC)\n\n22,900.59\n\n+30.19\n\n+(0.13%)\n\nAt close: November 14 at 5:15:59 PM EST\n\n^IXIC ^GSPC ^DJI\n\nAdvanced Chart\n\nDate\n\nClose\n\nOpen\n\nHigh\n\nLow\n\nIn another jolt to the AI outlook, AMD said Monday it has signed a multiyear deal with OpenAI to supply chips that will bring in tens of billions of dollars in annual revenue. It also gives the ChatGPT owner the option to purchase up to 10% of AMD, one of Nvidia's (NVDA) key rivals.\n\nThat served as another AI-related boost to a market that has proved resilient despite the shutdown in Washington. AMD's wild rally lifted other chip stocks, with Applied Materials (AMAT), Micron (MU), and TSM (TSM) all rallied.\n\nInvestors have focused on upbeat prospects for AI even as the shutdown delays key economic releases such as the monthly jobs report.\n\nOn Wall Street, data-starved investors could still get inputs for calculating the chances of two interest rate cuts this year. On the Federal Reserve front, President Trump-backed governor Stephen Miran is set to speak on Wednesday, followed by Chair Jerome Powell on Thursday. And data from non-government sources is also on deck, with the University of Michigan's consumer sentiment report for October as the likely highlight.\n\nMeanwhile, third quarter earnings are set to start trickling in, with results from PepsiCo (PEP), Delta Air Lines (DAL), and Levi Strauss (LEVI) on the docket this week."
  },
  {
    "title": "S&P 500, Nasdaq close at fresh records to start week, helped by AMD gains - CNBC",
    "source": "CNBC",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFAwNGx3Z29ydWxEWXJTT3lubUFVVVFRV0YyY3hFTm8tR2p0aUFZQ0lTZ0R3QnNvU1QtT3diUXluNGVBU3lEUUJSVm0tVFNwZnUwNlA2OGxHN2dhdDRiRDlYM2Z2NWZtdEdEX29nWUlWV0owSVIxdWVJ0gF8QVVfeXFMTUtqRGRQdFVfSTFfb2JLaWZmcmdoeDhsZGU0OTVINDZNenZZQ3ZyT1FYOWlCWnVSQ2wwWTZMNGFpYlpkREE4bWMtQWRZTkJtelYzWkJtQjNBVDV3dk8yYzJuLW4weGpCNEpuSjNwcjdBZjlSNUNWYnVZMlkxUg?oc=5",
    "published_date": "2025-10-05 22:05:36",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFAwNGx3Z29ydWxEWXJTT3lubUFVVVFRV0YyY3hFTm8tR2p0aUFZQ0lTZ0R3QnNvU1QtT3diUXluNGVBU3lEUUJSVm0tVFNwZnUwNlA2OGxHN2dhdDRiRDlYM2Z2NWZtdEdEX29nWUlWV0owSVIxdWVJ0gF8QVVfeXFMTUtqRGRQdFVfSTFfb2JLaWZmcmdoeDhsZGU0OTVINDZNenZZQ3ZyT1FYOWlCWnVSQ2wwWTZMNGFpYlpkREE4bWMtQWRZTkJtelYzWkJtQjNBVDV3dk8yYzJuLW4weGpCNEpuSjNwcjdBZjlSNUNWYnVZMlkxUg?oc=5\" target=\"_blank\">S&amp;P 500, Nasdaq close at fresh records to start week, helped by AMD gains</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "content": "The S&P 500 and Nasdaq Composite\n\nclosed at record highs on Monday, spurred by optimism about increased mergers and acquisitions activity after two major deals were announced.\n\nThe broad market S&P 500 gained 0.36% to end the day at 6,740.28, while the tech-heavy Nasdaq advanced 0.71% to finish at 22,941.67. The Dow Jones Industrial Average\n\n, however, fell 63.31 points, or 0.14%, to close at 46,694.97, weighed down by a decline in shares of Sherwin-Williams and Home Depot\n\n.\n\nThe Russell 2000 closed at a record high after crossing 2,500 for the first time. It settled up 0.4% at 2,486.36.\n\nThe S&P 500 and Nasdaq saw a boost from AMD\n\njumping almost 24% after the company reached a deal with Sam Altman’s AI leader that could ultimately end up giving the ChatGPT company a 10% stake in the chipmaker. AMD will use certain graphics processing units rolled out over multiple years. Nvidia\n\n, AMD’s main competitor in graphics processors, came under pressure following that announcement.\n\nAdditionally, Comerica\n\nshares rallied nearly 14% after Fifth Third Bancorp reached a deal to buy the fellow regional bank for $10.9 billion in an all-stock transaction. The merger will form the ninth-largest U.S. bank by assets. The SPDR S&P Regional Banking ETF\n\njumped 1% on expectations more deals were ahead in the space. Overall M&A has been picking up, adding to the animal spirits seen in the stock market this year.\n\n“There is clearly an optimistic view of growth in the long term,” said Brian Mulberry, senior client portfolio manager at Zacks Investment Management. “There is a more business (and bank) friendly regulatory environment and everyone expects rates to be much lower by this time next year, perhaps even as much as 1.25% lower, making the return on these deals much better and faster.”\n\nInvestors have been looking past concerns about the current U.S. government shutdown, which has now dragged on into a second week after lawmakers once again failed to reach a deal on funding to keep the government open. The shutdown delayed the release of key economic data — including the September jobs report — which was originally due Friday.\n\n“As of now, the stock market is shrugging off the government shutdown, and is more focused on earnings optimism and the prospect of additional Federal Reserve rate cuts,” said Robert Edwards, chief investment officer at Edwards Asset Management.\n\n“We would consider any notable market dip from the shutdown as an ‘Investor Prime Day’ shopping opportunity,” he also said. “Even with the government shutdown and worries about the labor market, we believe the S&P 500 is on track to cross 7,000 by year-end.”\n\nDespite the data blackout, several Federal Reserve officials are slated to speak this week, including Fed Governor Stephen Miran on Wednesday and Chair Jerome Powell on Thursday.\n\nThe S&P 500 and Nasdaq Composite are coming off their fourth weekly advance in five weeks, rising 1.1% and 1.3%, respectively. The Dow rose for the third time in four weeks, advancing 1.1%."
  },
  {
    "title": "Markets News, Oct. 3, 2025: Stocks Post Weekly Gains; Indexes End Mixed Friday After Setting New Records as Palantir Pulls Nasdaq Lower - Investopedia",
    "source": "Investopedia",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE1YdS1uY1ZRdWxhc2Z2OXBTU1lWREVuX0Uzd1ItZmprbGRXeEZ0MWtfbVRuN1p2VDZlaDAwa2lnWU5Fd3V4dllubXFRRXNMY0Z0TEVSc3NkMGw2dmJMeUpTc1ZpNDV5UTE3TzVPRE9JMA?oc=5",
    "published_date": "2025-10-03 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1YdS1uY1ZRdWxhc2Z2OXBTU1lWREVuX0Uzd1ItZmprbGRXeEZ0MWtfbVRuN1p2VDZlaDAwa2lnWU5Fd3V4dllubXFRRXNMY0Z0TEVSc3NkMGw2dmJMeUpTc1ZpNDV5UTE3TzVPRE9JMA?oc=5\" target=\"_blank\">Markets News, Oct. 3, 2025: Stocks Post Weekly Gains; Indexes End Mixed Friday After Setting New Records as Palantir Pulls Nasdaq Lower</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>",
    "content": "Major stock indexes recorded weekly gains but ended mixed Friday after setting new all-time highs, as the Nasdaq closed lower after being dragged by a sharp decline in shares of Palantir Technologies.\n\nThe tech-heavy Nasdaq Composite closed down 0.3% after Palantir (PLTR) sank 7.5% on a Reuters report that the U.S. Army warned of security problems in a new battlefield communications network the company is developing, ending a streak of five sessions in which all three major indexes finished in the green. The blue-chip Dow Jones Industrial Average ended up 0.5% and benchmark S&P 500 was fractionally higher to set closing records for a third consecutive day.\n\nInvestors mostly have taken in stride the government shutdown that began Wednesday, which is delaying the release of economic data, including Friday's key jobs report. The lack of data complicates decision-making for Federal Reserve officials, who meet later in the month to decide whether to lower interest rates.\n\nWest Texas Intermediate crude oil futures were up 0.6% to $60.80 per barrel at 4 p.m. ET. Gold futures, which set their latest record high early yesterday before retreating, advanced 1.2% to $3,915 an ounce.\n\nThe U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies, pulled back slightly to 97.71. The 10-year Treasury yield—which affects borrowing costs on all sorts of loans—ticked higher to 4.12% from 4.09% as Thursday's close. Bitcoin was at $122,500, paring gains after approaching a record high near $124,000 in midday trading.\n\nChip stocks, which led advances this week, were mixed. Micron (MU) and TSMC (TSM) shares rose 2.3% and 1.4%, respectively, but those of Intel (INTC), which rose nearly 4% yesterday, finished 1.3% lower. Nvidia (NVDA) stock, which closed at its latest all-time high Thursday, ended down 0.7%.\n\nTesla (TSLA) shares, which closed down 5% yesterday even though third-quarter deliveries figures came in better than expected, opened higher but finished down 1.4%.\n\nElsewhere, Applied Materials (AMAT) shares fell 2.7% after the semiconductor equipment maker said export curbs to China will cause a combined $710 million revenue hit over the fourth quarter and fiscal 2026. Rumble (RUM) shares popped 16% when the video sharing platform and cloud services provider announced a partnership with AI-powered answer engine Perplexity."
  },
  {
    "title": "Nvidia Higher But Chip Deal With U.A.E. Faces Delay – Is The Stock Still A Buy Now? - Investor's Business Daily",
    "source": "Investor's Business Daily",
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxQSGdMRWhURkNkeG9JdDM0WjQwZW9NalU5ZG85ek1teFhxMVVwaUJia1RyMzhkNFpfbVpzUDZIVmpsZ256SjNBaUN3aXJSUDl2UmVhbkhUUzU1S2hDQzZwUWhKQ3pQQjdZVnV5bjROdl9JVmtFQkRpYWx5ZVAyQ2VkbUdB?oc=5",
    "published_date": "2025-10-03 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxQSGdMRWhURkNkeG9JdDM0WjQwZW9NalU5ZG85ek1teFhxMVVwaUJia1RyMzhkNFpfbVpzUDZIVmpsZ256SjNBaUN3aXJSUDl2UmVhbkhUUzU1S2hDQzZwUWhKQ3pQQjdZVnV5bjROdl9JVmtFQkRpYWx5ZVAyQ2VkbUdB?oc=5\" target=\"_blank\">Nvidia Higher But Chip Deal With U.A.E. Faces Delay – Is The Stock Still A Buy Now?</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investor's Business Daily</font>",
    "content": "Nvidia (NVDA) cleared a buy point on Tuesday and headed higher into a buy zone on Friday despite delays in an export deal for the artificial intelligence chipmaker. Is Nvidia stock still a buy now?\n\nA multi-billion-dollar deal between the U.S. and the United Arab Emirates to send Nvidia chips to the U.A.E. has yet to take effect five months after the contract signing, The Wall Street Journal reported late Thursday. U.S. Commerce Secretary Howard Lutnick has to approve the shipment of chips, which is contingent upon the U.A.E. investing in the U.S.\n\n$100 Billion OpenAI Partnership\n\nNvidia last week said it would invest up to $100 billion in ChatGPT developer OpenAI. Under the strategic partnership, OpenAI will deploy at least 10 gigawatts of AI data centers running Nvidia processors.\n\n↑\n\nNOW PLAYING\n\nThese Companies Want To Replace Nvidia In China. Can They Succeed?\n\nOpenAI's valuation has hit $500 billion, The Wall Street Journal reported Thursday, citing sources, as did other news outlets.",
    "years,": "fter its $100 billion investment in OpenAI, analysts at Melius Research said, according to Barron's.\n\nOn Tuesday, Citi raised its price target on Nvidia to 210 from 200, citing expansion in the AI infrastructure market and its recent investment in OpenAI.\n\nThe Nvidia/OpenAI deal could raise antitrust concerns, Andre Barlow, an antitrust lawyer with Doyle, Barlow & Mazard, said, according to a recent Reuters report, indicating the partnership may capture the Department of Justice's attention.\nNvidia Stock: Analysts Mostly Positive\n\nMeanwhile, KeyBanc this week raised its price target to $250 from $230 while maintaining an overweight rating. Analyst John Vinh noted that Nvidia had increased performance specifications for its next-generation chip Rubin that is set for mass-scale production next year. The move distances Nvidia from competitors such as Advanced Micro Devices (AMD), Vinh aid.\n\nEarlier, Evercore ISI raised its Nvidia sales estimate by $5.5 billion in the second half of 2026 and boosted its price target to 225 from 214. Bank of America analysts see the OpenAI investment returning three to five times the initial investment. But Stacy Rasgon at Bernstein raised",
    "concerns": "ith Nvidia investing in startups that then go on to buy its graphic processing units. But the analyst noted that demand remained healthy.\n\nBarclays last week joined a chorus of analysts turning bullish, giving Nvidia stock a price target of $240, up from $200 while maintaining an overweight rating.\n\nNvidia is positioned to gain the most from the $2 trillion spending on AI infrastructure, Barclays noted.\nU.S.-China Talks\n\nNvidia stock suffered a slight loss after some news about China regulators.\n\nThe China's Cyberspace Administration ordered major tech companies to stop buying AI chips made by Nvidia, The Financial Times reported in mid-September.\n\nEarlier, China's State Administration for Market Regulation was reported to be investigating whether Nvidia breached the country's antitrust rules by acquiring Mellanox Technology in 2020.\n\nNvidia said it had received approval",
    "authorities": "o move forward with its planned acquisition of the network technology group.\n\nMeanwhile, President Donald Trump and President Xi Jinping of China had a phone conversation and agreed to more talks in October.\n\nThe Information recently reported that Nvidia had ordered component makers of its China chip to stop production. This comes after the Cyberspace Administration of China had asked Nvidia in July to explain if its chips could be tracked or shut down remotely.\n\nChief Executive Jensen Huang said the chips do not have such capabilities. Separately, the AI giant may also be working on a new chip for China that may be more powerful than the H20, Reuters reported.\nNvidia Stock: Second-Quarter Results\n\nNvidia reported fiscal second-quarter earnings of $1.05 per share, topping the estimate of $1.01 per share. Sales of $46.74 billion beat views of $46.05 billion. The company reported zero sales from its China H20 chip and did not include H20 sales to China in its fiscal third-quarter revenue outlook of $54 billion.\n\nWall Street was expecting $53.43 billion. The company also announced a $60 billion buyback.\n\nAre These Magnificent Seven Stocks A Buy Now?\nAlphabet | Amazon | Apple | Meta | Microsoft | Nvidia | Tesla\n\n \nNvidia's China Revenue Deal\n\nIn August, Nvidia struck a deal that secured a license to sell its H20 AI chips in China, but, in exchange, the company will give 15% of its revenue from chip sales in China to the U.S. government.\n\nNvidia's revenue deal could invite scrutiny, according to Doug Jacobson, an international trade attorney at Jacobson Burton Kelley, Barron's reported. Jacobson said that the State Department is able to charge export-license fees related to defense technology, but the fees are not based on earned revenue.\n\nNvidia placed an order for 300,000 H20 chips with Taiwan Semiconductor, adding to an existing inventory of 600,000-700,000 chips, Reuters reported in late July, citing unnamed sources. In 2024, Nvidia sold around 1 million H20 chips, the report said, citing research firm SemiAnalysis.\nA $4 Trillion Market Cap\n\nIn July, Nvidia became the first company to hit a $4 trillion market cap, overtaking tech titans Apple and Microsoft.\n\nDiscover Top Growth Stocks With IBD Leaderboard\n\nIn terms of its 12-month price performance, Nvidia has outperformed 89% of all other stocks in Investor's Business Daily's database. The stock has gained 33% year-to-date, based on Friday's closing price.\n\nFunds own 41% of Nvidia's outstanding shares, according to IBD MarketSurge. Its Accumulation/Distribution Rating has been improving and sits at B. That shows that funds have started to buy the stock. The rating measures price and volume action over the last 13 weeks.\n\nThe AI chip behemoth has a top-level Earnings Per Share Rating of 99. Further, the stock's all-around strength, or Composite Rating, sits at 99.\nIs Nvidia Stock A Buy?\n\nLooking at chart signals and technical measures can help investors assess whether Nvidia stock is a buy or sell now.\n\nNvidia has broken out of a flat base at a buy point of 184.48. That triggers a buy signal. Shares have risen into the 5% buy zone that goes up to 193.70. Nvidia is a buy now."
  },
  {
    "title": "Stock market today: Dow, S&P 500 close at record highs to cap Wall Street's latest winning week - Yahoo Finance",
    "source": "Yahoo Finance",
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNVy0xQkxuaFExdWoybWh3X012NEcyYU5mMTFWTkZKZTlYWk9abDk2LWg3UlRVVzhCUTZzRUJGVEdEZDFhRlBzeDBaZW85LS1YNlZMM21saWg1WUhybXdtWjNlQmNVVzdNU3pWQzVZUUllY1BhQWVNZkhCWXFEZVZXQWpRSkdGX1lCN09hVmc0Sk5HR2NmVUVtVmhGMllZaFQwd0pUZzRRR3pJWF9CU2loRlNkQUl1QVRuWERjMGVaWWcyNTZNU2xJNHBYVmxEczdYOG55aHN1dG5iQQ?oc=5",
    "published_date": "2025-10-07 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi2gFBVV95cUxNVy0xQkxuaFExdWoybWh3X012NEcyYU5mMTFWTkZKZTlYWk9abDk2LWg3UlRVVzhCUTZzRUJGVEdEZDFhRlBzeDBaZW85LS1YNlZMM21saWg1WUhybXdtWjNlQmNVVzdNU3pWQzVZUUllY1BhQWVNZkhCWXFEZVZXQWpRSkdGX1lCN09hVmc0Sk5HR2NmVUVtVmhGMllZaFQwd0pUZzRRR3pJWF9CU2loRlNkQUl1QVRuWERjMGVaWWcyNTZNU2xJNHBYVmxEczdYOG55aHN1dG5iQQ?oc=5\" target=\"_blank\">Stock market today: Dow, S&amp;P 500 close at record highs to cap Wall Street's latest winning week</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "content": "US stocks capped a winning week on Friday as Wall Street fixated on the promise of artificial intelligence, even as a government shutdown delayed the release of the monthly jobs report.\n\nThe Dow Jones Industrial Average (^DJI) touched 47,000 before paring gains but still closed up 0.5% at a fresh all-time high. The benchmark S&P 500 (^GSPC) rose just above the flatline and eked out a new record too. The tech-heavy Nasdaq Composite (^IXIC) erased earlier gains to fall 0.3% as Tesla (TSLA) stock sank.\n\nAll three major averages closed out the week with gains of more than 1%.\n\nDJI - Delayed Quote • USD\n\nDow Jones Industrial Average (^DJI)\n\n47,147.48\n\n-309.72\n\n(-0.65%)\n\nAt close: November 14 at 4:59:07 PM EST\n\n^DJI ^GSPC ^IXIC\n\nAdvanced Chart\n\nDate\n\nClose\n\nOpen\n\nHigh\n\nLow\n\nWall Street has largely shrugged off the initial stages of the US government shutdown. Its impact was felt in investor circles Friday, as it delayed the release of the data, leaving Wall Street and the Federal Reserve in the dark. In its absence, Wall Street has turned to a bevy of private data that has confirmed the labor market's sharp slowdown this week.\n\nBut even amid the unanswered questions on the health of the US economy, stocks keep rising to new records, largely on the back of continued AI fervor. OpenAI's valuation climbed to $500 billion, making the company the most valuable startup in the world.\n\nOn Friday, new AI deals boosted optimism. Hitachi LTD (6501.T) teamed up with OpenAI (OPAI.PVT) on energy projects, while Fujitsu (6501.T) expanded work with Nvidia (NVDA). Other sectors also continued standout performances — most notably pharma stocks, which by one measure were headed toward their best week in over a decade.\n\nMeanwhile, there was no immediate end in sight to the shutdown. Democrats continue to push for the continuation of healthcare subsidies as a condition of funding the government, while Republicans refuse to negotiate on the issue until the government is back up and running. At the same time, President Trump has continued to ramp up his threats to fire federal workers and defund projects in Democratic-leaning states.\n\nLIVE COVERAGE IS OVER 23 updates\n\nJenny McCall\n\nTue, October 7, 2025 at 6:18 AM CDT\n\nJenny McCall\n\nCiti’s Montagu warns US tech rally at risk from profit taking\n\nCiti strategist have warned that US technology stocks face growing risks as investors seek to cash in on this year’s record-breaking rally.\n\nNasdaqGS - BOATS Real Time Price • USD\n\nAdvanced Micro Devices, Inc. (AMD)\n\n246.81\n\n-1.15\n\n(-0.46%)\n\nAt close: November 14 at 4:00:02 PM EST\n\n249.32\n\n+2.51\n\n+(1.02%)\n\nOvernight: 10:36:26 PM EST\n\nAdvanced Chart\n\nDate\n\nClose\n\nOpen\n\nHigh\n\nLow\n\nBloomberg News reports:\n\nThe Nasdaq 100 (^NDX) is most vulnerable to the threat, after soaring 46% from its April lows thanks to resurgent enthusiasm around advances in artificial intelligence. The tech-heavy benchmark set its latest record on Monday after Advanced Micro Devices Inc.’s (AMD) blockbuster deal with OpenAI (OPAI.PVT).\n\n“Profit-taking risks have rapidly risen across markets, and are particularly elevated for Nasdaq, potentially hampering further upside,” the Citi team led by Chris Montagu wrote in a note.\n\nOptimism over AI keeps propelling the stock market to new highs, eclipsing concerns such as the US government shutdown or the lingering threat to the economy from trade tariffs. The Nasdaq 100 has already closed at a record 30 times this year through Monday, according to data compiled by Bloomberg. Last year, the benchmark set 45 closing peaks.\n\nFor the moment, investors continue to add to wagers on stock market gains.\n\nRead more here.\n\nInes Ferré\n\nFri, October 3, 2025 at 3:04 PM CDT\n\nInes Ferré\n\nDow, S&P 500 eke out new records as Wall Street shrugs off US government shutdown\n\nInvestors shrugged off a government shutdown as the Dow and S&P 500 posted fresh records on Friday.\n\nThe Dow Jones Industrial Average (^DJI) jumped 0.5%, briefly hitting 47,000 throughout the session.\n\nThe S&P 500 (^GSPC) pared gains but still managed to close above the flatline. The Nasdaq Composite (^IXIC) fell about 0.3%.\n\nMeanwhile, cryptocurrencies rallied as bitcoin (BTC-USD) moved above $122,000 per token.\n\nSNP - Delayed Quote • USD\n\nS&P 500 (^GSPC)\n\n6,734.11\n\n-3.38\n\n(-0.05%)\n\nAt close: November 14 at 4:59:07 PM EST\n\n^GSPC ^IXIC ^DJI\n\nAdvanced Chart\n\nDate\n\nClose\n\nOpen\n\nHigh\n\nLow\n\nInes Ferré\n\nFri, October 3, 2025 at 2:30 PM CDT\n\nInes Ferré\n\nNetflix stock on track to end week down 5% as Elon Musk calls for users to cancel subscriptions\n\nYahoo Finance's Alexandra Canal reports:\n\nNetflix (NFLX) stock was on track to end the week down 5% on Friday as Tesla (TSLA) CEO Elon Musk continues to urge consumers to boycott the streaming giant."
  },
  {
    "title": "S&P 500 posts winning week, but Friday rally fizzles: Live updates - CNBC",
    "source": "CNBC",
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE83NkxhVk1XWFJkQzFuVTBDTUUxTW4zLTI0QXVhMHI4YURoZ19NUHYxeWpmZDJNbmxVWkI2YzJuMW05WW90cnR0Y2xhckN4UHgzYWdpbTVEbVBYZ21FYk1vdkh1aUZUUWFTNFdJOHR4US0tc0dxWVFr0gF8QVVfeXFMT0RyLVhVMG9HVDNIZWxPZXp5ZE83U01OT2UzYnk5UzhKNzJlSkRHeVQ0Ym9qYzFEbWo0aWJqano4T1ZKRUN4Y19QYUpJaXg1eWg3VEQ1MmRrbGlyUFRHbGJOTnljOUVxQVdzdTFCTmlmOUlRYUVGV1ZMTGZlSw?oc=5",
    "published_date": "2025-10-03 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE83NkxhVk1XWFJkQzFuVTBDTUUxTW4zLTI0QXVhMHI4YURoZ19NUHYxeWpmZDJNbmxVWkI2YzJuMW05WW90cnR0Y2xhckN4UHgzYWdpbTVEbVBYZ21FYk1vdkh1aUZUUWFTNFdJOHR4US0tc0dxWVFr0gF8QVVfeXFMT0RyLVhVMG9HVDNIZWxPZXp5ZE83U01OT2UzYnk5UzhKNzJlSkRHeVQ0Ym9qYzFEbWo0aWJqano4T1ZKRUN4Y19QYUpJaXg1eWg3VEQ1MmRrbGlyUFRHbGJOTnljOUVxQVdzdTFCTmlmOUlRYUVGV1ZMTGZlSw?oc=5\" target=\"_blank\">S&amp;P 500 posts winning week, but Friday rally fizzles: Live updates</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>",
    "content": "The S&P 500\n\nretreated from a record on Friday but held on to solid weekly gains despite a U.S. government shutdown dragging on for a third day.\n\nThe broad market index closed little changed, ticking up just 0.01% at 6,715.79, while the Nasdaq Composite\n\ndeclined 0.28% to settle at 22,780.51. The Dow Jones Industrial Average outperformed, trading higher by 238.56 points, or 0.51%, to finish at 46,758.28. The Russell 2000\n\nalso popped 0.72% to close at 2,476.18. All four benchmarks had hit all-time highs earlier in the session.\n\nStocks were knocked down a bit in afternoon trading by declines in key technology names like Palantir Technologies\n\n, Tesla and Nvidia. Palantir led the S&P 500′s pullback, falling 7.5%, while Tesla and Nvidia dropped more than 1% and almost 1%, respectively. The CBOE Volatility Index\n\nspiked, signaling some investors were scrambling to buy some protection against a future S&P 500 decline in the form of put contracts.\n\nStill, the three leading indexes saw a positive weekly finish. The broad market S&P 500 rose around 1.1% on the week, along with the 30-stock Dow, while the tech-heavy Nasdaq increased 1.3%. The small-cap Russell has jumped nearly 2% in the period.\n\nInvestors have been overlooking anxieties surrounding the government shutdown, which entered its third day Friday. While the stoppage has exacerbated underlying concerns this year about macroeconomic and policy headwinds, inflation risks and a slowing labor market, investors expect it to be short-lived, thereby limiting potential hits to the U.S. economy. Those on Wall Street also believe that the shutdown won’t stop the momentum in the artificial intelligence trade. Shutdowns have not been market-moving events in the past.\n\nThe shutdown has led to an economic data blackout, and the Labor Department’s pause on virtually all activity has blocked the Friday release of the September nonfarm payrolls report. Although that removes a factor that could lend pressure to stocks, it lessens the amount of economic data the Federal Reserve can take into account for its interest rate decision at its October meeting. Markets largely expect the central bank will lower its key interest rate by a quarter percentage point then, per the CME FedWatch tool.\n\nAdding to ongoing concerns regarding the jobs market, President Donald Trump has threatened massive layoffs and said Thursday that the Democrats have given him an “unprecedented opportunity” to cut federal agencies. Treasury Secretary Scott Bessent also told CNBC Thursday that the current lapse in federal funding could lead to “a hit to the GDP, a hit to growth and a hit to working America.” The Congressional Budget Office estimates 750,000 federal workers will be furloughed each day.\n\nTheir remarks come a day after private payrolls posted their biggest decline since March 2023 in September, according to ADP. Wednesday’s report serves as yet another sign that the labor market is weakening, and some believe that the state of the labor market combined with the shutdown bolster the case for the Fed to cut.\n\n“We view September’s mixed, private-sourced substitutes for the Labor Department’s delayed jobs report as soft enough to justify another interest-rate cut by the Federal Reserve at the October 29 FOMC meeting,” said Jennifer Timmerman, senior investment strategy analyst at Wells Fargo Investment Institute. “Prospects for further rate cutting by the Fed, reinforced by the yellow flag for the economy raised by the latest jobs data, has cemented a rally in stocks and left the yield on the benchmark 10-year Treasury note low enough, at 4.11%, to lift the S&P 500 to a fresh all-time high.”"
  },
  {
    "title": "Stock market today: Dow sinks 800 points, S&P 500 and Nasdaq see worst day since April as Trump's renewed tariff threats spook Wall Street - Yahoo Finance",
    "source": "Yahoo Finance",
    "url": "https://news.google.com/rss/articles/CBMikwJBVV95cUxPLTFDb3VHNFM4MzVjR0hTcW1RQmNPZ2lnTnZTbDljSGdWNVlvVzBYSVJ0eWdIVXIwY21rNTJ3X1I3SjVQb01yZGRTQnBQaFIyQ1hSbkdkNkl5ZkxMM2V4SlJQZ1JVbHdUblRXYlNTSW5ySldzMlVxdlRTYkFMSXI4dzZ6V3ppUm5PZlkxUkFEQUNRM2JzTDl1THRjR2RsRVdBbVRGWVhsekZ3c3c3U05QSGJOVFA1elA3MTktRndURG1yZUFRQURFRlhOWk5RZW1kdWVDZ0ZLcjczU1VNQVh0OGFGMktpLXJReHE3ZHRoNWIwQjFHbldsRFAzdlg2YnkzQnM2OVRuZTRLN2Vyc0haa3JIWQ?oc=5",
    "published_date": "2025-10-10 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMikwJBVV95cUxPLTFDb3VHNFM4MzVjR0hTcW1RQmNPZ2lnTnZTbDljSGdWNVlvVzBYSVJ0eWdIVXIwY21rNTJ3X1I3SjVQb01yZGRTQnBQaFIyQ1hSbkdkNkl5ZkxMM2V4SlJQZ1JVbHdUblRXYlNTSW5ySldzMlVxdlRTYkFMSXI4dzZ6V3ppUm5PZlkxUkFEQUNRM2JzTDl1THRjR2RsRVdBbVRGWVhsekZ3c3c3U05QSGJOVFA1elA3MTktRndURG1yZUFRQURFRlhOWk5RZW1kdWVDZ0ZLcjczU1VNQVh0OGFGMktpLXJReHE3ZHRoNWIwQjFHbldsRFAzdlg2YnkzQnM2OVRuZTRLN2Vyc0haa3JIWQ?oc=5\" target=\"_blank\">Stock market today: Dow sinks 800 points, S&amp;P 500 and Nasdaq see worst day since April as Trump's renewed tariff threats spook Wall Street</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "content": "US stocks closed sharply lower on Friday as President Trump and China traded blows on tariffs, with Trump threatening a \"massive increase\" in duties on Chinese goods.\n\nThe Dow Jones Industrial Average (^DJI) lost 1.9%, or over 870 points, while the S&P 500 (^GSPC) fell roughly 2.7%. The tech-heavy Nasdaq Composite (^IXIC) slid around 3.6%, leading losses.\n\nDJI - Delayed Quote • USD\n\nDow Jones Industrial Average (^DJI)\n\n47,147.48\n\n-309.72\n\n(-0.65%)\n\nAt close: November 14 at 4:59:07 PM EST\n\n^DJI ^IXIC ^GSPC\n\nAdvanced Chart\n\nDate \t11/14 12:56 PM\n\nClose \t47,302.17\n\nOpen \t47,322.07\n\nHigh \t47,322.31\n\nLow \t47,295.20\n\n^IXIC\t22,989.91\n\n^GSPC\t6,758.77\n\nTrump unloaded on China and its leader, Xi Jinping, in a lengthy post on Truth Social on Friday. The post came after China heated up trade tensions with the US, adding new port fees on American ships and launching an antitrust investigation into Qualcomm (QCOM). Beijing has also been in the midst of tightening export controls on rare earth minerals, and it recently halted purchases of US soybeans.\n\n\"Some very strange things are happening in China!\" Trump posted. In his post, he also floated canceling a planned meeting with Xi later this month, saying there was \"no reason\" for it before threatening to dramatically increase tariffs.",
    "America,": "rump wrote.\n\nThe return to Trump's tariff war put a pin in an already wobbly week for markets, which were pulled in different directions by AI demand hopes and US government shutdown worries. With Friday's decline, all major indexes logged a firmly down week after a retreat from record highs.\n\nMeanwhile, private data was in focus for investors as the release of official economic figures has been delayed due to the US government shutdown, which entered its 10th day. The University of Michigan's reading on consumer sentiment in October, released Friday morning, showed Americans are still feeling sour about the economy as they fret about jobs prospects and high inflation.\n\nLooking ahead, investors are counting down for earnings season to start in earnest next week, led by JPMorgan (JPM) and Citigroup (C). Performance is expected to be softer, with analysts betting tariffs will bite into revenue for the quarter.\nLIVE COVERAGE IS OVER 20 updates\n\n    Ines Ferré\n    Fri, October 10, 2025 at 3:01 PM CDT\n    Ines Ferré\n    Stocks sink as US-China trade war flares\n\n    Stocks closed sharply lower on Friday after President Trump said his administration is considering imposing a",
    "increase": "n tariffs on Chinese goods.\n\n    The Dow Jones Industrial Average (^DJI) sank more than 800 points, or 1.9%, while the S&P 500 (^GSPC) tumbled 2.7%, near the lows of the session.\n\n    The tech-heavy Nasdaq Composite (^IXIC) fell roughly 3.6% as semiconductor and other tech stocks sank.\n\n    Bitcoin (BTC-USD) prices also plummeted on Friday as investors rushed for the exits amid a broad-based market sell-off.\n\n    Stocks had been at record highs this week as the AI trade and easing monetary policy expectations fueled enthusiasm for a continuing rally.\n\n    But Friday's social media post from Trump flared fears that US-China trade tensions have escalated to new levels.\n    DJI - Delayed Quote • USD\n    Dow Jones Industrial Average (^DJI)\n\n47,147.48\n-309.72\n(-0.65%)\nAt close: November 14 at 4:59:07 PM EST\n^DJI ^IXIC ^GSPC\nAdvanced Chart\nDate \t\nClose \t\nOpen \t\nHigh \t\nLow \t\nInes Ferré\nFri, October 10, 2025 at 2:20 PM CDT\nInes Ferré\nBitcoin tanks as investors go risk-off, cryptocurrencies sink\n\nBitcoin (BTC-USD) prices plummeted on Friday as investors rushed for the exits amid a broad-based market sell-off.\n\nThe accelerated losses in afternoon trading occurred after President Trump threatened 'massive"
  },
  {
    "title": "Markets News, Oct. 15, 2025: Stock Indexes End Volatile Session Mostly Higher; Bank of America, Morgan Stanley Continue Run of Strong Bank Results - Investopedia",
    "source": "Investopedia",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9wNzlFWEMtRVB2SEJQd0R3NGVDY2lpb3VaS055ck5oZWZCVzQxQVNESld0TlRYcVFSR1VFRmNjdC0zTHRsekxFLWxkUENOSWU3LWpmUldJcWc1WXZ5X0pKMG52VlVxOUlDNmVhOTdZOA?oc=5",
    "published_date": "2025-10-15 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9wNzlFWEMtRVB2SEJQd0R3NGVDY2lpb3VaS055ck5oZWZCVzQxQVNESld0TlRYcVFSR1VFRmNjdC0zTHRsekxFLWxkUENOSWU3LWpmUldJcWc1WXZ5X0pKMG52VlVxOUlDNmVhOTdZOA?oc=5\" target=\"_blank\">Markets News, Oct. 15, 2025: Stock Indexes End Volatile Session Mostly Higher; Bank of America, Morgan Stanley Continue Run of Strong Bank Results</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>",
    "content": "Major stock indexes ended mostly higher after volatile trading Wednesday, as big banks' results continued to impress.\n\nThe tech-heavy Nasdaq and benchmark S&P 500 closed up a respective 0.7% and 0.4%, while the blue-chip Dow Jones Industrial Average finished fractionally lower. All three indexes traded higher until early afternoon, when they briefly turned lower before reversing course, but the Dow could not hold its modest gains into the close.\n\nBank of America (BAC) and Morgan Stanley (MS) shares ended up 4.4% and 4.7%, respectively, after they reported third-quarter results above expectation. Their rivals JPMorgan Chase (JPM), Citigroup (C), Goldman Sachs (GS), and Wells Fargo (WFC) kicked off Q3 bank earnings season yesterday, with all four topping analysts' estimates.\n\nOn Tuesday, the S&P 500 turned lower in the last half hour of trading after President Donald Trump wrote on his Truth Social network that",
    "retribution.": "rump's threat boosted shares of U.S. agricultural firm Bunge Global (BG), which rose nearly 13% to lead the S&P 500 today.\n\nMarket volatility continued Wednesday, the start of the third week of the U.S. government shutdown. With data releases delayed, investors were closely watching the release of the Federal Reserve's so-called",
    "Book,": "hich said that economic activity changed little on balance from the prior report. Meanwhile, the Bureau of Labor Statistics plans to release on Oct. 24 the Consumer Price Index inflation report for September that originally was scheduled for today.\n\nGold futures hit $4,200 an ounce for the first time Wednesday, and were up 1.6% to $4,230 at 4 p.m. ET. West Texas Intermediate crude oil futures slipped 0.4% to $58.50 a barrel. Bitcoin was at roughly $111,300, down from from an overnight high of $113,600.\n\nThe 10-year Treasury yield ticked higher to 4.04%. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies, was down 0.3% to 98.75.\n\nIn corporate news, shares of ASML Holding (ASML) ended up 2.7% after the Dutch chipmaking-equipment firm reported better-than-expected third-quarter bookings and profit amid robust AI demand. The news helped shares of chipmakers Wednesday, with Advanced Micro Devices (AMD) soaring 9.4% to lead the Nasdaq. Intel (INTC), Broadcom (AVGO), and ON Semiconductor (ON) all rose as well, while Nvidia (NVDA) shares finished 0.1% lower after leading Dow decliners yesterday with a 4.4% drop.\n\nAlso, Stellantis (STLA) stock advanced 2.1% after the Jeep and Chrysler parent said it planned to invest $13 billion over four years to boost its U.S. manufacturing efforts, and shares of Walmart (WMT) closed up 1.7% to lead the Dow for a second straight day after the world's biggest retailer said it was partnering with ChatGPT parent OpenAI on",
    "experiences.": "oteworthy S&P 500 Movers on Wednesday\nOctober 15, 2025 06:15 PM EDT\n\nAdvancers\n\n    Shares of grain processing company Bunge Global (BG) soared 13% to log the strongest daily performance in the S&P 500 after President Trump threatened to embargo Chinese cooking oil. Bunge is the world's largest oilseed processor. Shares of Archer-Daniels-Midland (ADM) also gained.\n    Advanced Micro Devices (AMD) surged 9.4%, leading other semiconductor stocks higher a day after the chipmaker announced a deal to sell chips to Oracle (ORCL). An upbeat outlook from chipmaking equipment leader ASML (ASML) and a multibillion-dollar data center deal also contributed to enthusiasm for stocks tied to the semiconductor industry. ASML, Applied Materials (AMAT), Lam Research (LRCX), and KLA (KLAC) all rose.\n    Morgan Stanley (MS) and Bank of America (BAC) both saw shares jump more than 4% after they became the latest financial firms to report better-than-expected quarterly results. Morgan Stanley's results were boosted by strong trading revenue and Bank of America benefited from growth in investment banking fees.\n\nDecliners\n\n    Progressive (PGR) shares sank nearly 6% after the insurer reported third-quarter earnings that fell short of analysts' expectations. The results reflected a $950 million charge related to the firm's Florida auto insurance business generating profits above the state's limits, requiring Progressive to return that amount to Florida policyholders. Shares of competitor Allstate (ALL) were down 4.3%.\n\n-Michael Bromberg\n\nWalmart Hits Another Record High—Watch These Levels\nOctober 15, 2025 06:00 PM EDT\n\nWalmart (WMT) shares hit a fresh all-time high Wednesday, adding to gains that followed news yesterday the big box retailer had become the latest company to team up with ChatGPT developer OpenAI.\n\nThe retailer said the collaboration will allow shoppers to discover and buy items via instant checkout directly through the AI platform, adding that it also plans to enable conversational interactions with ChatGPT in the search bar on its websites.\n\nWalmart shares rose nearly 2% to just over $109 on Wednesday, pacing Dow Jones Industrial Average advancers for the second straight day. The stock has gained 21% so far this year, outpacing broader market returns, as the retailer has benefitted from strong e-commerce sales and demand across income levels amid economic uncertainty.\n\nWalmart shares staged a decisive breakout from a symmetrical triangle on Tuesday, laying the groundwork for a continuation move higher.\nSource: TradingView.com.\n\nThe measured move technique projects a bullish near-term price target of $113. Investors should also watch crucial support levels on Walmart's chart around $105, $100 and $96.\n\nRead the full technical analysis piece here.\n\n-Timothy Smith\n\nUS-China Trade Dispute Fans Worries About What's Next for the Stock Market\nOctober 15, 2025 04:07 PM EDT\n\nU.S.-China trade tensions are back—and things could get worse for investors before they get better, some on Wall Street say, with the possibility of a big pullback in stocks and a retreat in some hot sectors.\n\nAbsent a near-term truce, according to analysts, the bull market that has chugged higher since April could be stopped in its tracks as investors grow wary about how long momentum stocks can keep climbing and harbor anxiety around rich valuations.\nFlags of the U.S. and China seen in Shanghai in April 2024.\nSome market watchers think the latest round of U.S.-China trade friction could last a while.\n\nWang Gang / VCG via Getty Images\n\nRecent market action has already signaled what could come: Gold has climbed, volatility has picked up, and shares of tech stocks like Nvidia (NVDA) and Intel (INTC) have shown vulnerability, dragging on broad market indexes. Still, investors haven't folded: the S&P 500, the Dow industrials, and the Nasdaq are all still near record levels.\n\nFriday's trade escalation with China appears to represent the first meaningful decline of this bull run, according to Morgan Stanley equity strategist Michael Wilson. And without a de-escalation in trade tensions between the world's largest economies, he wrote, stocks could see a decline in the S&P 500 of more than 15%. (The index fell over 11% from April 1, the day before Liberation Day, to its closing low on April 8.)\n\nThe best hedges against short-term policy uncertainty, according to Morgan Stanley, is quality—in short, companies with strong fundamental and financial characteristics—and healthcare, the",
    "preferred": "efensive sector play. Semiconductors, quantum computing, and crowded stocks that have been climbing higher have the",
    "risk,": "e wrote. Given the risk of outsize potential tariffs on China, the firm is underweight on consumer discretionary goods stocks.\n\nRead the full article here."
  },
  {
    "title": "Stock market today: Dow slides, S&P 500, Nasdaq retreat from records as rally takes another breather - Yahoo Finance",
    "source": "Yahoo Finance",
    "url": "https://news.google.com/rss/articles/CBMi4AFBVV95cUxObFRaUldoZTNzX3VGdEhnUHBRSlRsaW8zRGJHSjFFRGQyclQtMzhGdjBlU3BBSXliVllNemNheFJzYTFtakhBV3VHSDl3MndwZngwTk9ucXBhRjgxWlFscHlaRHVWVzlqRUxHakVzaUFTbnluVVdhWXhNM18tNFZaQjNFNVVRWk85VVVsTHRJVFNtUmJGVFZiSTdZb192dFBBdFA1ZEZ0cVY5TUlwdy1oUklHU3ZTOE52aXpBNlZGTGpNZVROWmhDbE1Xa1Vmc2NnQXVFS3MzalhLZFNqVUl1Rw?oc=5",
    "published_date": "2025-10-09 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi4AFBVV95cUxObFRaUldoZTNzX3VGdEhnUHBRSlRsaW8zRGJHSjFFRGQyclQtMzhGdjBlU3BBSXliVllNemNheFJzYTFtakhBV3VHSDl3MndwZngwTk9ucXBhRjgxWlFscHlaRHVWVzlqRUxHakVzaUFTbnluVVdhWXhNM18tNFZaQjNFNVVRWk85VVVsTHRJVFNtUmJGVFZiSTdZb192dFBBdFA1ZEZ0cVY5TUlwdy1oUklHU3ZTOE52aXpBNlZGTGpNZVROWmhDbE1Xa1Vmc2NnQXVFS3MzalhLZFNqVUl1Rw?oc=5\" target=\"_blank\">Stock market today: Dow slides, S&amp;P 500, Nasdaq retreat from records as rally takes another breather</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Yahoo Finance</font>",
    "content": "StockStory Top Pick\n\nNVDA\n\n+1.77%\n\n^GSPC\n\n-0.05%\n\nES=F\n\n+0.38%\n\nYM=F\n\n+0.05%\n\nNQ=F\n\n+0.60%\n\nUS stocks retreated Thursday as investors paused to assess the optimism around AI and interest-rate cuts that has buoyed markets amid the government shutdown.\n\nThe S&P 500 (^GSPC) lost around 0.3% after another record close for the broad benchmark on Wednesday, as Wall Street returned to rally mode. The tech-heavy Nasdaq Composite (^IXIC) traded about 0.1% lower, faring better thanks to a run higher from Nvidia (NVDA), which closed at its latest record.\n\nThe Dow Jones Industrial Average (^DJI) fell 0.6%. Meanwhile, the torrid rally in gold (GC=F) took a pause amid signs of profit-taking, last seen back below $4,000 per troy ounce.\n\nDJI - Delayed Quote • USD\n\nDow Jones Industrial Average (^DJI)\n\n47,147.48\n\n-309.72\n\n(-0.65%)\n\nAt close: November 14 at 4:59:07 PM EST\n\n^DJI ^IXIC ^GSPC\n\nAdvanced Chart\n\nDate\n\nClose\n\nOpen\n\nHigh\n\nLow\n\nThe mood is muted as the ongoing federal shutdown puts off scheduled data releases, including the jobless claims update that had been due Thursday. That has put the focus more firmly on coming earnings, watched for insight into the economy's health and to test high-running hopes for an AI boom.\n\nPepsiCo (PEP) eked out quarterly profit and revenue beats, ushering in the third-quarter earnings season, which kicks off in earnest with big bank reports next week. Delta Air Lines (DAL) results also surpassed expectations, helping the carrier lead other airline stocks higher.\n\nEarnings season kicks off in earnest next week, when the biggest US banks offer their third-quarter reports.\n\nLIVE COVERAGE IS OVER 25 updates\n\nInes Ferré\n\nThu, October 9, 2025 at 3:01 PM CDT\n\nInes Ferré\n\nStocks pause rally, gold retreats as US dollar firms\n\nStocks retreated on Thursday as long-term bond yields rose and gold (GC=F) fell below $4,000 amid an uptick in the US dollar (DX-Y.NYB) and a peace plan for the Middle East.\n\nThe S&P 500 (^GSPC) fell 0.2%, while the tech-heavy Nasdaq Composite (^IXIC) decreased less than 0.1%, retreating from record highs in the prior session.\n\nThe Dow Jones Industrial Average (^DJI) fell 0.5%.\n\nNasdaqGS - BOATS Real Time Price • USD\n\nNVIDIA Corporation (NVDA)\n\n190.17\n\n+3.31\n\n+(1.77%)\n\nAt close: November 14 at 4:00:01 PM EST\n\n192.03\n\n+1.86\n\n+(0.98%)\n\nOvernight: 10:39:09 PM EST\n\nAdvanced Chart\n\nDate\n\nClose\n\nOpen\n\nHigh\n\nLow\n\nDespite Thursday's pullback, Nvidia (NVDA) stock hit an all-time intraday high during the session, while airline stocks popped after Delta Air Lines (DAL) reported strong earnings.\n\nMeanwhile, shares in rare earth stocks rose sharply after Beijing announced new export controls on the minerals from China.\n\nInes Ferré\n\nThu, October 9, 2025 at 2:23 PM CDT\n\nInes Ferré\n\nBarr favors moving cautiously on rate cuts, reinforcing Fed divide on inflation risks\n\nYahoo Finance's Jennifer Schonberger reports:\n\nFederal Reserve governor Michael Barr said Thursday that he favors a cautious approach to interest rates given uncertainties about whether tariffs would push inflation higher, breaking with some colleagues who are pushing aggressively for more easing.\n\nHe even expressed skepticism about whether the Fed should fully “look through” higher inflation from import tariffs, as some of his fellow policymakers have argued while making their own case for lower rates.\n\nRead more here.\n\nInes Ferré\n\nThu, October 9, 2025 at 2:00 PM CDT\n\nInes Ferré\n\nRepublican unity to avoid shutdown concessions is cracking after six failed votes\n\nYahoo Finance's Ben Werschkul reports:\n\nWhen the shutdown commenced, it was Republicans who were confident that Democrats would crack in the face of a GOP plan to vote again and again on the same bill while offering zero concessions.\n\nBut six failed votes later — and with poll results showing the GOP is taking slightly more of the blame while plans for \"permanent\" cuts from President Trump have yet to materialize — it's Republican resolve that is increasingly in question.\n\nHigh-profile GOP defectors are now openly pushing their leaders to reverse course and come to the negotiating table over the thorny issue of reviving expiring Affordable Care Act subsidies.\n\nAnd Trump has said multiple times this week he is open to healthcare talks — albeit with a shifting message on timing — saying Thursday at a cabinet meeting, \"We are the ones that are saving healthcare.\" He also responded to the sense in Washington that Democrats are gaining ground by saying it's the Democrats that are divided.\n\nRead more here.\n\nInes Ferré\n\nThu, October 9, 2025 at 1:15 PM CDT\n\nInes Ferré\n\nBessent says US ended fiscal 2025 with lower deficit-to-GDP ratio\n\nYahoo Finance's Jennifer Schonberger reports:\n\nTreasury Secretary Scott Bessent said the US ended the fiscal year of 2025 with a lower deficit-to-GDP ratio than the year before and sounded an optimistic note for 2026, noting that the US is on its way to lowering deficits without causing a recession.\n\nThe Treasury has not been able to release the exact fiscal 2025 deficit-to-GDP figure due to the government shutdown. Bessent cited the Congressional Budget Office when making his claim Thursday that the key ratio was lower in the fiscal year ending Sept. 30 than the year prior.\n\nRead more here.\n\nLaura Bratton\n\nThu, October 9, 2025 at 12:33 PM CDT\n\nLaura Bratton\n\nIntel stock reverses loss as latest chips raise prospects for its ailing manufacturing business\n\nIntel (INTC) stock reversed earlier losses after the chipmaker unveiled the specs for its latest Panther Lake personal computer chip, also known as the Core Ultra series 3 processor, which is produced using the company's latest manufacturing technology, 18A.\n\nNasdaqGS - BOATS Real Time Price • USD\n\nIntel Corporation (INTC)\n\n35.52\n\n-0.39\n\n(-1.09%)\n\nAt close: November 14 at 4:00:00 PM EST\n\n35.90\n\n+0.38\n\n+(1.07%)\n\nOvernight: 10:38:48 PM EST\n\nAdvanced Chart\n\nDate\n\nClose\n\nOpen\n\nHigh\n\nLow\n\nThe company also gave a first look at its next-generation Clearwater Forest data center server chip, also known as Xeon 6+, and said that the processor will launch in the first half of 2026.\n\nIntel's latest manufacturing process, called 18A, is critical for the company's struggling contract manufacturing business, Intel Foundry Services (IFS). Intel has said it will use 18A to make its own internal products rather than chips for outside customers, as analysts had expected. Still, the success of the technology will be a key indication of whether the chipmaker can draw in external customers for its next-generation manufacturing process, 14A.\n\nIntel's debut of its latest chips comes after OpenAI CEO Sam Altman snubbed the company's manufacturing segment in an interview with Stratechery on Wednesday.\n\nAsked whether he sees a need in the chip production market — which is dominated by Taiwan's TSMC (TSM) — for companies to bring business to Intel, Altman said, \"I would like TSMC to just build more capacity.\"\n\nRead more here.\n\nJake Conley\n\nThu, October 9, 2025 at 11:59 AM CDT\n\nJake Conley\n\nMortgage rates move slightly lower as government shutdown delays key data\n\nUS mortgage rates fell slightly this week as the markets continue to navigate the government shutdown and ensuing dearth of financial data. Yahoo Finance's Claire Boston reports:\n\nThe average 30-year mortgage rate was 6.3% this week through Wednesday, according to Freddie Mac data, from 6.34% a week earlier. Average 15-year mortgage rates were 5.53%, from 5.55%.\n\nFor the past month, mortgage rates have settled in a narrow range around 6.3%. There’s been little to spur big movements. The latest jobs report, which in recent months has sparked big moves in mortgage rates, was originally scheduled for release last Friday, but has been delayed due to the government shutdown. Markets have instead been relying on alternative data sources, like ADP’s payrolls report for private employers.\n\nThat data, released Oct. 1, showed that the US shed 32,000 jobs in September. The dismal numbers briefly sent the 10-year Treasury yield, which mortgage rates closely track, lower, but it’s since rebounded.\n\nRead more here.\n\nJake Conley\n\nThu, October 9, 2025 at 11:30 AM CDT\n\nJake Conley\n\nOil prices fall on news of agreements in Israel-Palestine peace plan\n\nOil prices fell Thursday after President Trump said Wednesday night that Israel and the Palestinian group Hamas have agreed to the \"first phase\" of a peace plan proposed by the US administration.\n\nFutures contracts on Brent (BZ=F) crude, the global benchmark for crude oil, fell by more than 0.8% Thursday after a week of positive movement. Futures on West Texas Intermediate (CL=F) crude, the US benchmark, fell by roughly the same margin.\n\nNY Mercantile - Delayed Quote • USD\n\nBrent Crude Oil Last Day Financ (BZ=F)\n\n63.82\n\n-0.57\n\n(-0.89%)\n\nAs of 10:28:55 PM EST. Market Open.\n\nBZ=F CL=F\n\nAdvanced Chart\n\nDate \t2025-11-16 06:04:00\n\nClose \tn/a\n\nOpen \tn/a\n\nHigh \tn/a\n\nLow \tn/a\n\nUnder the terms of the peace plan proposed by the Trump administration, both sides of the Israel-Palestine conflict would release all hostages and Israel would begin a withdrawal from Gaza, the nexus of the war. The agreement by Israel and Hamas to President Trump's proposal marks the first substantive step in months toward negotiations to potentially end the war.\n\nAs conflict in the Middle East had spilled outside of Israel and Palestine's borders, oil prices initially spiked upward — especially as Israel and Iran briefly exchanged airstrikes in early June — on worries of a substantive decrease of Iranian oil supply to the global market. But the spike was short-lived, and both Brent crude and WTI crude are down roughly 12% on the year.\n\nRystad Energy, a global energy consultancy and research firm, said substantive price movement will hinge on the long-term success or failure of a peace deal and, separately, developments in the war in Ukraine.",
    "If the plan for stable peace proves credible, its impact on prices could be more structural and profound. Yet, as long as the war in Ukraine continues, the geopolitical risk premium is destined to remain elevated.": "ake Conley\nThu, October 9, 2025 at 10:26 AM CDT\nJake Conley\nRare earth prices rise after Beijing announces export curbs\n\nShares in rare earth stocks rose sharply Thursday morning after Beijing announced new export controls on the miner"
  },
  {
    "title": "U.S. stock futures fall as government shutdown hits markets — Dow, S&P 500, and Nasdaq show early losses - The Economic Times",
    "source": "The Economic Times",
    "url": "https://news.google.com/rss/articles/CBMi2wJBVV95cUxOQjFaZ1dVVWJqbDdPZzlwTWJ3Unh3R0FGdGhuY0huSGNPbk5SQXczZFFsb0lqTEh2SkgwZHo1ai1IeXNyekFrbU5DVmpkbHJkVkl0WUNBNTVSYTZ2cndReGtmekpMaWUxQS1TYWEybkxRaGNpb1hOclBFTUpTUTZ0Q2Z3RVJPM3ZEU204NlFmeUp0WDlFNUt6cmFsVk5vTndOUEZ6cVptYW1ub2pmQVdGT0k3REJsS3NQWmtIcUxkUWxLNHhnbWNOZTJTeFpoUWtzSTRSTGxMek55RXNzblNOSHQ2Ym5PTk9oOHpmTW9SOGthc3k1NnpDUGNmTVNucUZZZGw2VUN0ZU9ta0dHOWFQQV9NanJlRUtBV2M2UE5xRkxmYk80R0d4X0haVFlxblNFQ1F4c0FLbXM4R2IyNmVwMXFKaVMzalZtcG1PTjEySlNPMVF2bmtkN3JWNNIB4AJBVV95cUxQS1RjVEl3UFlXZjgyLWhyZjY0X1pDOFV0TElIdFVzajh2Zk1TSDNmaTFNQUszVXJQTURqVEk4NUhHbWZDTTZlbWNYcVhyRTdFQzlZT3BkUTZzNjdYZ2U0bTA4M0Uzay1jeV9zSFFZWjJ2UEdfakJxLXJQZklTMFJfampPZDFhS190V2JVZGZKWTNRTkVaU1NaaXlESk1fTDlSeFMwRHA1eE1PY1Z1d2Q0SU5SV0dkT0t5YXd2ZWNlWDFEbmhETlg2T1JiNldWRlBuTS1TT1VCeEV3QzlvNl9XQ192S3NhN204MUZTUXctWE9qLXBPbk96Y2xycm51cjZabkd5Nm5lTkt4Q1gwdXE4dWhIRlNaeU55bWZ4Rmdhc0dGdmU1RDNkcWFXVU9fVi1ZV3dKekZ5Q1k1S0JBLUxZaUdsSXJqSlB5ci1xZU41Z0l4b0xOQzdNdS0yTUtBZWV4?oc=5",
    "published_date": "2025-10-01 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi2wJBVV95cUxOQjFaZ1dVVWJqbDdPZzlwTWJ3Unh3R0FGdGhuY0huSGNPbk5SQXczZFFsb0lqTEh2SkgwZHo1ai1IeXNyekFrbU5DVmpkbHJkVkl0WUNBNTVSYTZ2cndReGtmekpMaWUxQS1TYWEybkxRaGNpb1hOclBFTUpTUTZ0Q2Z3RVJPM3ZEU204NlFmeUp0WDlFNUt6cmFsVk5vTndOUEZ6cVptYW1ub2pmQVdGT0k3REJsS3NQWmtIcUxkUWxLNHhnbWNOZTJTeFpoUWtzSTRSTGxMek55RXNzblNOSHQ2Ym5PTk9oOHpmTW9SOGthc3k1NnpDUGNmTVNucUZZZGw2VUN0ZU9ta0dHOWFQQV9NanJlRUtBV2M2UE5xRkxmYk80R0d4X0haVFlxblNFQ1F4c0FLbXM4R2IyNmVwMXFKaVMzalZtcG1PTjEySlNPMVF2bmtkN3JWNNIB4AJBVV95cUxQS1RjVEl3UFlXZjgyLWhyZjY0X1pDOFV0TElIdFVzajh2Zk1TSDNmaTFNQUszVXJQTURqVEk4NUhHbWZDTTZlbWNYcVhyRTdFQzlZT3BkUTZzNjdYZ2U0bTA4M0Uzay1jeV9zSFFZWjJ2UEdfakJxLXJQZklTMFJfampPZDFhS190V2JVZGZKWTNRTkVaU1NaaXlESk1fTDlSeFMwRHA1eE1PY1Z1d2Q0SU5SV0dkT0t5YXd2ZWNlWDFEbmhETlg2T1JiNldWRlBuTS1TT1VCeEV3QzlvNl9XQ192S3NhN204MUZTUXctWE9qLXBPbk96Y2xycm51cjZabkd5Nm5lTkt4Q1gwdXE4dWhIRlNaeU55bWZ4Rmdhc0dGdmU1RDNkcWFXVU9fVi1ZV3dKekZ5Q1k1S0JBLUxZaUdsSXJqSlB5ci1xZU41Z0l4b0xOQzdNdS0yTUtBZWV4?oc=5\" target=\"_blank\">U.S. stock futures fall as government shutdown hits markets — Dow, S&amp;P 500, and Nasdaq show early losses</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times</font>",
    "content": "U.S. stock futures opened lower on October 1, 2025, as investors reacted to the first government shutdown in nearly seven years. Dow Jones Industrial Average futures (YMZ25) fell 322 points, or 0.69%, to 46,367. S&P 500 futures (ESZ25) dropped 54.50 points, or 0.81%, to 6,684.25, while Nasdaq 100 futures (NQZ25) declined 31 points, or 0.20%, to 15,131. The shutdown has created market uncertainty, with possible delays in economic data and con ..\n\nRead more at:\n\nhttps://economictimes.indiatimes.com/news/international/us/u-s-stock-futures-fall-today-october-1-as-government-shutdown-hits-markets-dow-sp-500-and-nasdaq-show-early-losses-nike-lithium-americas-apple-and-nvidia-stand-out/articleshow/124255360.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst"
  },
  {
    "title": "Markets News, Oct. 10, 2025: Stocks End Sharply Lower as U.S.-China Trade Tensions Resume; Major Indexes Post Weekly Losses - Investopedia",
    "source": "Investopedia",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTFBGRDNrblVEM2NpN0FscVNZSEdJQ2tGUFB3dzZtOUZYbXlNQ3MyNlcwNmN3X2xDUlZxRnltcmE5LUdDdTNScXZ5OVgzY1NBUjd4Sml3MVozWEVKbEVDcEcxNVQxR2REczdQM0xOMHFfUQ?oc=5",
    "published_date": "2025-10-10 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTFBGRDNrblVEM2NpN0FscVNZSEdJQ2tGUFB3dzZtOUZYbXlNQ3MyNlcwNmN3X2xDUlZxRnltcmE5LUdDdTNScXZ5OVgzY1NBUjd4Sml3MVozWEVKbEVDcEcxNVQxR2REczdQM0xOMHFfUQ?oc=5\" target=\"_blank\">Markets News, Oct. 10, 2025: Stocks End Sharply Lower as U.S.-China Trade Tensions Resume; Major Indexes Post Weekly Losses</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>",
    "content": "U.S. stock futures fall as government shutdown hits markets — Dow, S&P 500, and Nasdaq show early losses\n\nU.S. stock market futures sl ..\n\nRead more at:\n\nhttps://economictimes.indiatimes.com//news/international/us/3i/atlas-leaked-actual-footage-shows-large-vessel-and-nasa-activated-planetary-defense-network-for-interstellar-object-heres-all-about-shocking-claims-and-what-is-iawn-campaign-japanese-released-clip-interstellar-visitor/articleshow/124790362.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst"
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens - Investopedia",
    "source": "Investopedia",
    "url": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOSU5ZZFBONk1KUm9LVUhzRDVaN0J4M1dWLU9vYXAwZ0lPSGhmQVVVeHFfUlVWZVJtdElUTmw1Uk40STI5S2lRcmh3LUs3dGxLUU5WTXI4RkhPSnY1djlYbUhlLUx2bnl3YzhQUmdGYXdmLUVPMnIxRmVodzJ1cTNxR1VnM3ZuMVdzSTh5NmhHcTVBcDMyalRrVzlYY0tPOE9W?oc=5",
    "published_date": "2025-10-06 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMioAFBVV95cUxOSU5ZZFBONk1KUm9LVUhzRDVaN0J4M1dWLU9vYXAwZ0lPSGhmQVVVeHFfUlVWZVJtdElUTmw1Uk40STI5S2lRcmh3LUs3dGxLUU5WTXI4RkhPSnY1djlYbUhlLUx2bnl3YzhQUmdGYXdmLUVPMnIxRmVodzJ1cTNxR1VnM3ZuMVdzSTh5NmhHcTVBcDMyalRrVzlYY0tPOE9W?oc=5\" target=\"_blank\">5 Things to Know Before the Stock Market Opens</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>",
    "content": "tock futures are moving higher in early trading as investors watch negotiations around the U.S. government shutdown; Bitcoin and gold hit new highs; oil prices are on the rise after OPEC and its allies agreed to a modest production increase; Advanced Micro Devices (AMD) shares are jumping after the chipmaker announcing a deal with OpenAI; and Tesla (TSLA) stock is climbing after the EV maker teased a Tuesday event that analysts think could bring a lower-cost model. Here's what you need to know today.\n\n1. Stock Futures Rise as Government Shutdown Continues\n\nStock futures are higher in premarket trading as investors monitor for new developments in the U.S. government shutdown. S&P 500 futures were higher by 0.3% recently, while Dow Jones Industrial Average futures added 0.2%, after both of the major indexes climbed to record highs Friday. Nasdaq futures were up 0.7%. The yield on the 10-year Treasury note, which can influence the borrowing costs on a range of consumer loans, edged up to 4.16%.\n\n2. Bitcoin, Gold Hit New Highs\n\nBitcoin (BTCUSD) is trading at just above $124,000 after it hit a new high over the weekend amid uncertainty surrounding a U.S. government shutdown and waning value of the U.S. dollar. The cryptocurrency rose above $125,000 early Sunday morning, surpassing the previous high of $124,480 set in August. Bitcoin is up more than 50% from its April lows of around $80,000. Investors seeking safety also pushed gold prices to new highs, with futures trading of the yellow metal at more than $3,950 an ounce.\n\n3. Oil Futures Move Higher as OPEC Announces Modest Production Increase\n\nOil futures advanced in premarket trading after oil producing countries announced a production boost that was smaller than some investors expected. Oil futures traded at around $62 a barrel, up about 2% after the Organization of the Petroleum Exporting Countries and its allies (OPEC+) announced a production increase of 137,000 barrels a day in November. That’s the same level of increase announced for October, where some analysts had expected an even larger increase in November.1\n\n4. AMD Stock Surges on Chip Deal with OpenAI\n\nShares of Advanced Micro Devices (AMD) are higher by 25% in premarket trading after the chipmaker announced a deal with ChatGPT maker OpenAI to build 6 gigawatts of computing power using AMD chips, with the first gigawatt of deployment planned for the second half of 2026. The announcement didn’t include details on costs. Shares of rival chipmaker Nvidia (NVDA) are 2% lower in early trading.2\n\n5. Tesla Stock Gains After Teasing Tuesday Event\n\nTesla (TSLA) is teasing an Oct. 7 event that some analysts believe could bring an announcement related to a lower-cost vehicle in the U.S., with one social media post by the company showing a vehicle’s headlights.345 Tesla CEO Elon Musk has made a lower-cost version of its electric vehicle a goal of the company and was reportedly planning a cheaper version of its Model Y SUV for the Chinese market next year. The event comes after Tesla’s third-quarter deliveries came in better than expected. Tesla shares are higher by more than 2% in premarket trading.\n\nDo you have a news tip for Investopedia reporters? Please email us at\n\ntips@investopedia.com"
  },
  {
    "title": "Stock Market News, Oct. 2, 2025: Dow, S&P 500 and Nasdaq tally fresh round of record highs as market climbs for fifth straight day - MarketWatch",
    "source": "MarketWatch",
    "url": "https://news.google.com/rss/articles/CBMiyANBVV95cUxPRDdJRmZpeUQyRXZBWktUVTFjRHBORWczalc4SFhYa3c1alhuNkNrazl6SU1KbWU0NTNVMVdpV0tPSXdZQngyM3k0Z0dMSGNrd3NFN1FMS3owMWd2RHg0T0VLRThnS0FoUjZpejBEMU9ZMVM4UlQyX1pIeXg5VWtOdEhEdHV5NjBnazUxbWZzMF9YMlFERWlhZ2xYbVBST002WjRrV1lhOEdhZnZwWHdUQTc1UjEzSWN0N3Aza0V3amJNZkZDYkZBaVB3UXdLOEVPTjRaNzhuNDBUSjlWYU9aNEVQZ1Y2UDJ1akJkRTI5WldTNVM3Z2xIUGg4MEc5UFBWTXExcmVydFFJeXg2aFRDMXFGak1PeW9aTkV0MnZoUnB3dVIta1N1STZqeEpMUEpDM1FZYWhOSTA4OWNBLTZ0UkNfLW9BN0NlUnEzWVNYX1VMclA1UEdwOU90UHl1S2NYZ0tUMllmbjJDblhhOS1OZnU5Q2dlemJyRU9FUkQ3eWVGejk0OEJhRURSXzlkYnlOUWlVYlduVXRmR2JYVnRZckpyMzJhRnVXWXBpWFJnWGJXSzZTRzI3STJld3RfU29UR3FBc3htbGw?oc=5",
    "published_date": "2025-10-03 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiyANBVV95cUxPRDdJRmZpeUQyRXZBWktUVTFjRHBORWczalc4SFhYa3c1alhuNkNrazl6SU1KbWU0NTNVMVdpV0tPSXdZQngyM3k0Z0dMSGNrd3NFN1FMS3owMWd2RHg0T0VLRThnS0FoUjZpejBEMU9ZMVM4UlQyX1pIeXg5VWtOdEhEdHV5NjBnazUxbWZzMF9YMlFERWlhZ2xYbVBST002WjRrV1lhOEdhZnZwWHdUQTc1UjEzSWN0N3Aza0V3amJNZkZDYkZBaVB3UXdLOEVPTjRaNzhuNDBUSjlWYU9aNEVQZ1Y2UDJ1akJkRTI5WldTNVM3Z2xIUGg4MEc5UFBWTXExcmVydFFJeXg2aFRDMXFGak1PeW9aTkV0MnZoUnB3dVIta1N1STZqeEpMUEpDM1FZYWhOSTA4OWNBLTZ0UkNfLW9BN0NlUnEzWVNYX1VMclA1UEdwOU90UHl1S2NYZ0tUMllmbjJDblhhOS1OZnU5Q2dlemJyRU9FUkQ3eWVGejk0OEJhRURSXzlkYnlOUWlVYlduVXRmR2JYVnRZckpyMzJhRnVXWXBpWFJnWGJXSzZTRzI3STJld3RfU29UR3FBc3htbGw?oc=5\" target=\"_blank\">Stock Market News, Oct. 2, 2025: Dow, S&amp;P 500 and Nasdaq tally fresh round of record highs as market climbs for fifth straight day</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">MarketWatch</font>",
    "content": "Stock Market News, Oct. 2, 2025: Dow, S&P 500 and Nasdaq tally fresh round of record highs as market climbs for fifth straight day\n\nFor the first time since November 2023, the S&P 500, Dow Jones Industrial Average, Nasdaq Composite and Russell 2000 have all risen for five straight days.\n\nLast Updated:\n\nOct. 3, 2025 at 6:31 AM EDT\n\nThursday's Top Reads\n\nHere are the top stories to read ahead of Thursday's trading:\n\nGovernment shutdown means Fed lacks crucial data as it considers rate cuts.\n\nStocks and bitcoin are running on fumes and FOMO — but here’s how the market can steer clear of a selloff.\n\nWhy Nvidia, Broadcom and other high-flying stocks are especially risky now."
  },
  {
    "title": "5 Things to Know Before the Stock Market Opens - Investopedia",
    "source": "Investopedia",
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxOVFh4b3VudjBhVjN6Z2JkTVE2bVlzMWY3Ym45R3BLdEdETkwwYVVTLVNONS1aREs1MXJUZkY4RTJxZldocXlQWm1nRU9pZHpobkdUUU9sVWRKZjNJZzdwS05la2V2MmsxaThPUkpVdVhLTndLRkRXd0pwWTdfX2FJMV9lLWNmOVZ3SEh0eU1wRHBWY2U5eDF5U2NIcDh6N0h5eHc?oc=5",
    "published_date": "2025-10-10 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiogFBVV95cUxOVFh4b3VudjBhVjN6Z2JkTVE2bVlzMWY3Ym45R3BLdEdETkwwYVVTLVNONS1aREs1MXJUZkY4RTJxZldocXlQWm1nRU9pZHpobkdUUU9sVWRKZjNJZzdwS05la2V2MmsxaThPUkpVdVhLTndLRkRXd0pwWTdfX2FJMV9lLWNmOVZ3SEh0eU1wRHBWY2U5eDF5U2NIcDh6N0h5eHc?oc=5\" target=\"_blank\">5 Things to Know Before the Stock Market Opens</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>",
    "content": "5 Things to Know Before the Stock Market Opens\n\nNews of the day for Oct. 10, 2025\n\nBy Terry Lane\n\nTerry Lane\n\nFull Bio\n\nTerry has 25 years experience in journalism and communications, reporting on a range of topics that include personal finance, telecommunications, Congress, government regulations, and criminal justice. He has also worked on technology, energy, and environmental policy issues as a congressional press secretary and owned and published a local community newspaper in North Carolina.\n\nLearn about our editorial policies\n\nPublished October 10, 2025\n\n08:42 AM EDT\n\nTraders working on the floor of the New York Stock Exchange.\n\nThe S&P 500 and Nasdaq are on track to post gains for the week.\n\nMichael Nagle / Bloomberg / Getty Images\n\nStock futures are pointing to a slightly higher open after major indexes lost ground yesterday; the Bureau of Labor Statistics will bring back employees in order to produce a key inflation report; Nvidia (NVDA) shares are in focus after the AI darling hit a new all-time high; Applied Digital (APLD) stock is soaring on a strong earnings report and announcement of new data center deals; and shares of Levi Strauss (LEVI) are down even as the jeans maker reported better-than-expected earnings and raised its outlook. Here's what you need to know today.\n\n1. Stock Futures Inch Higher, Gold Back Above $4,000\n\nStock futures are higher this morning as the market looks to rebound from Thursday's downturn. Futures linked to the Dow Jones Industrial Average, the benchmark S&P 500 and the tech-heavy Nasdaq were each up 0.2% recently. The S&P 500 and Nasdaq come into today's session up 0.2% for the week, while the Dow has lost 0.8% over the period. Investors will be keeping a close eye on consumer sentiment data that's slated for release this morning. Gold futures were up about 1%, trading at around $4,010 an ounce, after slipping below the $4,000 threshold on Thursday following several days of record highs. Bitcoin was trading at $121,500, up slightly from its overnight lows. The yield on the 10-year Treasury note, which influences interest rates on consumer loans, declined to 4.10% from 4.15% yesterday afternoon.\n\n2. Government to Bring Back Furloughed Workers for Inflation Report\n\nDespite a federal government shutdown that is now in its tenth day, the Bureau of Labor Statistics will reportedly bring back some furloughed employees in order to produce the Consumer Price Index (CPI) inflation report for September. The Wall Street Journal reported that employees who produce the inflation data are being brought back because the data is used to calculate Social Security payments.1 The CPI report was originally scheduled for release next Wednesday, though it's unclear when the data will now be released. Hundreds of thousands of federal employees have been told to stay home as legislators continue to negotiate over the expiring healthcare subsidies that are at the root of the shutdown.\n\n3. Nvidia Shares Gaining After Hitting New High\n\nShares of Nvidia (NVDA) are poised to add to their record highs following a week of encouraging developments for the AI chipmaker. Bloomberg reported that the U.S. approved the sale of several billion dollars worth of Nvidia AI chip sales to the United Arab Emirates. The deal comes amid progress in negotiations between the U.S. and Saudi Arabia on a chip deal that would include Nvidia, according to a Wall Street Journal report. CEO Jensen Huang earlier this week said that AI has “substantially” boosted demand for computing power, comments that gave the stock a boost. Nvidia shares were up 0.7% in recent premarket trading, after tacking on nearly 2% yesterday. The stock has gained 43% since the start of the year, boosting its market capitalization to around $4.7 trillion, making it the world's most-valuable company by a wide margin.\n\n4. Applied Digital Soars on Earnings Beat, New Deal with CoreWeave\n\nShares of Applied Digital (APLD) surged in premarket trading after the AI data center builder posted better-than-expected earnings and reported on new deals. The Nvidia-backed firm reported an 84% jump in quarterly revenue to $64.2 million, above the $54.5 million projected by analysts tracked by Visible Alpha.2 Applied Digital reported an adjusted loss of 3 cents a share, in line with Wall Street analysts' expectations. The firm also said it finalized a new lease agreement with AI infrastructure provider CoreWeave (CRWV), bringing the total revenue for its North Dakota facility to $11 billion. Applied Digital shares, which had gained 280% so far this year as of yesterday's close, were up nearly 30% before the bell Friday.\n\n5. Levi’s Shares Decline Despite Strong Earnings, Improved Outlook\n\nShares of Levi Strauss (LEVI) slumped in premarket trading after the jeans maker reported better-than-expected earnings and raised its full-year outlook despite facing continued tariff pressures. Levi’s reported a 7% increase in third-quarter revenue to $1.54 billion, slightly above analysts' consensus view of $1.5 billion.3 The company reported adjusted earnings per share of 34 cents, above the 31 cents Wall Street had expected. Levi’s also said its now expects 2025 revenue to rise 6% and adjusted EPS to be between $1.27 and $1.32 per share, both above prior estimates. Levi’s raised its estimates despite projecting tariffs of 30% on Chinese imports and 20% on goods from other countries. The stock was down 7.5% recently."
  },
  {
    "title": "3 Stocks to Buy as Washington Stalls - The Motley Fool",
    "source": "The Motley Fool",
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxNVmxXdTkzeGhzNE1ZWWh1TTZINGxkblVTVXVKeF9RZHZrcFd5czdSQTlQc2J2OHdvUURudVhUMEhiSEZBdk91WW5Jek5YcGU3WVVGMl9qWG5SOE5RSVVYVk84NGZmTVJjY1ZVUGg5U3JxTlRBYU1jakJBNEJ5RkxScThDYU54QQ?oc=5",
    "published_date": "2025-10-07 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNVmxXdTkzeGhzNE1ZWWh1TTZINGxkblVTVXVKeF9RZHZrcFd5czdSQTlQc2J2OHdvUURudVhUMEhiSEZBdk91WW5Jek5YcGU3WVVGMl9qWG5SOE5RSVVYVk84NGZmTVJjY1ZVUGg5U3JxTlRBYU1jakJBNEJ5RkxScThDYU54QQ?oc=5\" target=\"_blank\">3 Stocks to Buy as Washington Stalls</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Motley Fool</font>",
    "content": "While the U.S. government has come to a halt, AI spending has not.\n\nWhile the temporary government shutdown is certainly having an adverse effect on certain parts of the economy that rely (either totally or in part) on government workers, it's not slowing the pace of artificial intelligence (AI) development. Companies building data center infrastructure, for instance, are still spending aggressively because no one wants to risk falling behind (although certain government permitting and interactions could slow things temporarily).\n\nLet's look at three stocks riding the AI boom to buy now that are unlikely to be stalled by the current heated political wrangling going on in Washington, D.C.\n\nArtist rendering of an AI chip.\n\nImage source: Getty Images.\n\nNvidia\n\nNvidia (\n\nNVDA\n\n+1.68%) has quietly been evolving from a provider of graphics processing units (GPUs) that power AI workloads into a company that is starting to shape how data centers get built and where AI is headed. The company's CUDA software platform, upon which most foundational AI code has been built, has given the company a wide moat, but it is starting to go beyond that.\n\nNvidia Stock Quote\n\nNASDAQ: NVDA\n\nNvidia\n\nToday's Change\n\n(1.68%) $3.14\n\nCurrent Price\n\n$190.00\n\nNVDA\n\nKey Data Points\n\nMarket Cap\n\n$4621B\n\nDay's Range\n\n$180.58 - $191.01\n\n52wk Range\n\n$86.62 - $212.19\n\nVolume\n\n5.8M\n\nAvg Vol\n\n184M\n\nGross Margin\n\n69.85%\n\nDividend Yield\n\n0.00%\n\nThe company is now dictating the shape of entire data center buildouts, packaging its chips with proprietary networking, cooling, and software stacks, and in some cases deciding which customers get the earliest shipments of its top-end hardware. Nvidia's recent investment of up to $100 billion in OpenAI is part of that strategy, as it locks in a huge customer for its highest-end chips while the two companies will work together to shape how the next generation of large language models is trained. This follows an earlier investment in Intel in which the company will use its central processing units (CPUs) and start to jointly develop chips.\n\nAnd while ASICs (application-specific integrated circuits) for AI workloads are on the rise, it has been reported that even powerhouses Amazon and Alphabet give Nvidia notice before announcing any updates to their custom chips. That is power right there, and why Nvidia is a stock to buy.\n\nTaiwan Semiconductor Manufacturing\n\nQuite simply, there is no AI without Taiwan Semiconductor Manufacturing (\n\nTSM\n\n+0.90%). TSMC currently manufactures nearly all of the world's most advanced chips, not just for Nvidia but also for other competitors such as Advanced Micro Devices and Broadcom.\n\nWhere to invest $1,000 right now?\n\nWe’ve been helping individual investors work toward their goals of beating the market for decades – not with hype, but with time-tested long-term stock recommendations, a team of experienced stock analysts, and a community that’s got your back.\n\nAfter all, Stock Advisor’s total average return is 1,035%* — a market-crushing outperformance compared to 191% for the S&P 500. Invest smarter, not harder. Join The Motley Fool today and revealed what we believe are the 10 best stocks for investors to buy right now.\n\nContinue ›\n\n*Stock Advisor returns as of November 16, 2025.\n\nTSMC's competitive edge is well known, as it has been the only foundry that can consistently produce high yields at smaller node sizes, which is needed to scale the manufacturing of advanced chips like GPUs. What is often overlooked is how that has shifted the balance of power to the company.\n\nTaiwan Semiconductor Manufacturing Stock Quote\n\nNYSE: TSM\n\nTaiwan Semiconductor Manufacturing\n\nToday's Change\n\n(0.90%) $2.55\n\nCurrent Price\n\n$284.75\n\nTSM\n\nKey Data Points\n\nMarket Cap\n\n$1477B\n\nDay's Range\n\n$273.25 - $286.83\n\n52wk Range\n\n$134.25 - $311.37\n\nVolume\n\n666K\n\nAvg Vol\n\n13M\n\nGross Margin\n\n58.06%\n\nDividend Yield\n\n0.01%\n\nWhile customers may want to diversify suppliers, they also cannot risk moving their most advanced designs elsewhere because no other foundry can match TSMC's consistency at scale. The company has been using that leverage to raise prices as it invests heavily in fabs outside Taiwan. It's also made TSMC much more of a partner to chipmakers than simply a contract manufacturer. Chip designers now must work with TSMC on their product roadmaps and secure future production well in advance.\n\nLike Nvidia, TSMC has a lot of power in the AI infrastructure industry that cannot be ignored.\n\nASML\n\nPerhaps the company most vital to the AI infrastructure buildout is often the one most overlooked. ASML (\n\nASML\n\n1.44%) has an effective monopoly on extreme ultraviolet lithography machines, the equipment that is required to print the smallest transistors on advanced chips. Without it, neither Nvidia nor TSMC would be in the position they are in today, because its technology is needed to make advanced chips.\n\nASML Stock Quote\n\nNASDAQ: ASML\n\nASML\n\nToday's Change\n\n(-1.44%) $-14.73\n\nCurrent Price\n\n$1005.13\n\nASML\n\nKey Data Points\n\nMarket Cap\n\n$390B\n\nDay's Range\n\n$981.00 - $1017.96\n\n52wk Range\n\n$578.51 - $1086.11\n\nVolume\n\n86K\n\nAvg Vol\n\n1.5M\n\nGross Margin\n\n52.70%\n\nDividend Yield\n\n0.01%\n\nEach of its machines sells for more than $220 million, and its new high-NA model costs nearly double that, yet customers have no alternative. The story with ASML is straightforward but powerful. As long as demand for AI chips drives foundries to expand capacity and shrink node sizes (how many transistors that can fit on a chip), ASML will keep selling a lot of EUV machines.\n\nIts move to take a stake in Mistral AI shows it is not standing still on innovation, but the real investment case is its unrivaled grip on the one technology that keeps shrinking node sizes. That makes it a powerful growth stock that is insulated from consumer trends and government shutdowns.\n\nShould you buy stock in Nvidia right now?\n\nBefore you buy stock in Nvidia, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $599,784!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,165,716!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 1,035% — a market-crushing outperformance compared to 191% for the S&P 500. Don't miss the latest top 10 list, available with Stock Advisor, and join an investing community built by individual investors for individual investors."
  },
  {
    "title": "Stock Market News From Oct. 7, 2025: S&P 500 Snaps Win Streak - Barron's",
    "source": "Barron's",
    "url": "https://news.google.com/rss/articles/CBMi-wJBVV95cUxQT1JyWmY4dDlNRGJhMTJwMmd1a0xZZ1lwNXJTY3loOE9EREZ6UzRMdjVTNlQ3X0dzWkl0UGQ4WUtSSzNEYzRKZTdiREJCVWtlbHBSelNGYUNGOWlMb1RyMFhmSHNQcjk4dTBZSW9MUVg2OTJPdkZtdEstYkZlQlJzLWVoRTIwaXMtMXdpZnBVZWlWd0dPeUZQLUFTSlRQdW96dVFuQlEzYk05TTFDeGUyVU14MlYxUEJ0ZnNtV1JYd3ZaWTNSUk9ZOTBBWF81WUN5T3pmSmxhMnhISGVPMk83R1dab3o3clNQenN3OFZ0ZzdXdGVUSmhsMFBhRXNfTWN2LW1oMURMTmthSl9NdkIxREZzbWhiWlBqaFBkSG5ubnFYZGhmaGptNUJEWmdaUk1zWHFZZVZmY1RHdmNLZ3BkbTFua2hWYlYzLURUT3JaZHBia2FDQ1BET0FkZ1p4VEFiQ25VX0NEZVFhUlNCdXpZcjlFSG9rUkJyeW5V?oc=5",
    "published_date": "2025-10-07 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi-wJBVV95cUxQT1JyWmY4dDlNRGJhMTJwMmd1a0xZZ1lwNXJTY3loOE9EREZ6UzRMdjVTNlQ3X0dzWkl0UGQ4WUtSSzNEYzRKZTdiREJCVWtlbHBSelNGYUNGOWlMb1RyMFhmSHNQcjk4dTBZSW9MUVg2OTJPdkZtdEstYkZlQlJzLWVoRTIwaXMtMXdpZnBVZWlWd0dPeUZQLUFTSlRQdW96dVFuQlEzYk05TTFDeGUyVU14MlYxUEJ0ZnNtV1JYd3ZaWTNSUk9ZOTBBWF81WUN5T3pmSmxhMnhISGVPMk83R1dab3o3clNQenN3OFZ0ZzdXdGVUSmhsMFBhRXNfTWN2LW1oMURMTmthSl9NdkIxREZzbWhiWlBqaFBkSG5ubnFYZGhmaGptNUJEWmdaUk1zWHFZZVZmY1RHdmNLZ3BkbTFua2hWYlYzLURUT3JaZHBia2FDQ1BET0FkZ1p4VEFiQ25VX0NEZVFhUlNCdXpZcjlFSG9rUkJyeW5V?oc=5\" target=\"_blank\">Stock Market News From Oct. 7, 2025: S&amp;P 500 Snaps Win Streak</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Barron's</font>",
    "content": "Key Events\n\n1 month ago\n\nOil Futures Settle Mixed With Higher OPEC+ Supply in View\n\n1 month ago\n\nS&P 500 Slips as AI Rally Hits a Snag\n\n1 month ago\n\nThe Nasdaq Is Down 1%. AI Stocks Are Sliding.\n\n1 month ago\n\nStocks Give Back Early Gains\n\n1 month ago\n\nS&P 500 Is Rising for Eighth Straight Session\n\n1 month ago\n\nS&P 500 Falling From Record High. Futures Slip Following AI Rally.\n\n1 month ago\n\nBitcoin Eases After Hitting Fresh Record High\n\n1 month ago\n\nDollar Rises on Political, Fiscal Worries Elsewhere\n\n1 month ago\n\nU.S. Treasury Yields Decline, Shutdown Seen Containing Rises for Now\n\nPinned Post\n\n1 month ago\n\nS&P 500 Snaps Win Streak as AI Rally Pauses\n\nBy\n\nConnor Smith\n\nThe S&P 500 fell for the first time in more than a week as Wall Street pumped the brakes on the autumn AI frenzy.\n\nThe market benchmark dropped 0.4%. The Dow Jones Industrial Average fell 92 points, or 0.2%. The Nasdaq Composite fell 0.7%.\n\nThe yield on the 2-year Treasury note was down to 3.57%. The 10-year yield dipped to 4.13%.\n\nThe S&P and Nasdaq actually hit their highest intraday levels on record earlier in the morning, but riskier assets and those tied to the AI trade turned south as consumer staples, utilities, financials, and health care stocks gained steam.\n\nAI stocks specifically suffered in the wake of a report from The Information, which cited internal documents at Oracle about the firm’s margins in its cloud business. The report suggested monetizing the AI buildout is still in its early stages.\n\nOracle rebounded a bit after Fox Business anchor Liz Claman reported, citing sources familiar to the situation, that the report on Oracle “does not reflect the actual financials of that business.”\n\nWhatever the reason, AI stocks have been on a tear in recent weeks amid a flurry of headlines regarding investments and partnerships related to chip makers and generative AI powerhouses. Most recently, OpenAI announced a partnership with AMD that sent the chipmaker surging.\n\nThe government shutdown hit its seventh day, but that hasn’t stopped the major indexes from hitting multiple record highs."
  },
  {
    "title": "Markets News, Oct. 9, 2025: Stocks End Lower After S&P 500, Nasdaq Hit Fresh Records; Delta, Pepsi Pop on Strong Results; Gold Falls Below $4,000 - Investopedia",
    "source": "Investopedia",
    "url": "https://news.google.com/rss/articles/CBMib0FVX3lxTE9qdEdfcUhZcmREcGZMQmExYkRWbnpUNFQwZmxUbHB2TW83LWdESU0zZGJVNXczTkp1enphZi1iV0tqa2VFNFVXV1JNMzlHUVZYdTZRcXJFNDJPU1E5UGsxNHJ1UWFXaWt1cUlLXzhRWQ?oc=5",
    "published_date": "2025-10-09 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9qdEdfcUhZcmREcGZMQmExYkRWbnpUNFQwZmxUbHB2TW83LWdESU0zZGJVNXczTkp1enphZi1iV0tqa2VFNFVXV1JNMzlHUVZYdTZRcXJFNDJPU1E5UGsxNHJ1UWFXaWt1cUlLXzhRWQ?oc=5\" target=\"_blank\">Markets News, Oct. 9, 2025: Stocks End Lower After S&amp;P 500, Nasdaq Hit Fresh Records; Delta, Pepsi Pop on Strong Results; Gold Falls Below $4,000</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>",
    "content": "Markets News, Oct. 9, 2025: Stocks End Lower After S&P 500, Nasdaq Hit Fresh Records; Delta, Pepsi Pop on Strong Results; Gold Falls Below $4,000\n\nBy Aaron Rennie\n\nUpdated October 09, 2025\n\n05:42 PM EDT\n\nTraders work on the floor at the New York Stock Exchange\n\nGold futures pulled back 2% Thursday to fall below $4,000 an ounce.\n\nMichael Nagle / Bloomberg via Getty Images\n\nMajor stock indexes closed lower after the benchmark S&P 500 and tech-heavy Nasdaq hit fresh records Thursday, while safe-haven gold fell back below $4,000, as the U.S. government shutdown continued.\n\nThe blue-chip Dow Jones Industrial Average, S&P 500, and Nasdaq ended a respective 0.5%, 0.3%, and 0.1% lower. Yesterday, the Nasdaq and S&P 500 posted record closing highs, while the Dow ended down by just one point.\n\nGold futures, which have soared 50% this year and crossed the $4,000 threshold for the first time this week amid a flight to safety, pulled back 2% to $3,990.\n\nThe 10-year Treasury yield—which affects borrowing costs on all sorts of loans—ticked higher to 4.14%. Bitcoin fell 2% to about $121,000. The U.S. dollar index, which tracks the value of the greenback against a basket of foreign currencies, advanced 0.5% to 99.44. West Texas Intermediate crude oil futures was down 1.7% to $61.50 per barrel.\n\nThursday was the ninth day of the U.S. government shutdown, and there are no obvious signs the funding stalemate will end soon, with President Donald Trump saying during a Cabinet meeting today that the White House plans to eliminate programs popular with Democrats.\n\nIn corporate news, shares of Delta Air Lines (DAL) surged 4.3% after the carrier reported record third-quarter revenue and issued a rosy outlook for Q4, while PepsiCo (PEP) stock rose 4.2% to lead after the soda and snacks giant's Q3 results topped estimates and it replaced its CFO as Elliott Investment Management presses for change.\n\nElsewhere, Nvidia (NVDA) shares advanced 1.8% to hit an all-time high on a report the White House and Saudi Arabia are nearing a deal to allow U.S. chipmakers to export semiconductors to the Gulf nation.\n\nAlso, Akero Therapeutics (AKRO) shares popped 16% after Novo Nordisk (NVO) announced it was buying the firm working on a liver disease treatment for up to $5.2 billion; Ferrari (RACE) shares sank 15% after the Italian luxury carmaker issued a soft outlook; and Tesla (TSLA) stock slipped 0.7% after the National Highway Traffic Safety Administration opened an investigation into the electric vehicle maker's Full Self-Driving software.\n\nIn addition, Costco Wholesale (COST) stock rose 3.1% after it reported strong monthly sales figures, while Boeing (BA) was the worst-performing stock in the Dow, with shares down 4.1% after Turkish Airlines' chair said the carrier might switch a recent order for 150 737 MAX planes to Airbus if engine talks fail."
  },
  {
    "title": "US stock market today: Dow Jones, S&P 500, and Nasdaq rise as investors eye tech, healthcare, and AI amid - The Economic Times",
    "source": "The Economic Times",
    "url": "https://news.google.com/rss/articles/CBMirAJBVV95cUxNcEJ3NUZIZVNyWDk0MHRiVmdsMUN1eDJaUnB0RkNTT3BGdzExRUFkUV9wLTlVaFN6OVM5YlYxSUVzSExoYzA2cHpwZGNnVE4zTkNydUx4Nm9LaHhSYkxDZmpaZWMzOW1oMnlnVVZXd0pUUEM1bXlWUzdyUTlsTUFSTEVPdFNDSWRSU3FmV1VkVmxSSE5memJKNWNyclpqZWhyMmtjUkhCV2hMQzlmbWh1ZGhvUzFpbk91aFBGN2hiWW51QzBad3ByZ1N2aDkybXRfVlMyQWUxSEZrVUdsUzdRSlVOSER0WG5BSG0tQzBJZmtWTkcwOXNGTmZUdnNhMGp1eWZSTnlRQzVYcDNGZVJmM0hEOU44cmFOZGszcnFmNkw0Sm1MaXFuaklmZGPSAbICQVVfeXFMTTBfd2NYZzYyWGFlWXNXV1ZxTFp4ZmxDOGhaUGVTRTU2aFVEZEpCMUJDbkxTYkpkVXQ2RDRrdGVtRVhSLUpHVW1VcVZ3b3B5MzM4Y3dJNjRJYzhXajNlTTNmOFJ0clBKb2dJZzNOZThMNDVyQ3hFc0QxZGRaRUpybWNJZERZZTRrY0NFcWxSNlR3XzB1bnNSYXhtVl9uX0k5ZkFHZlRoOWZYRnFxQ04wT2tjdlpReDlBTUFoTnBNcmNseE8zaEFOQXRtcHZ6TW9MVlJFOFUzUnZSaFBycVBTMlB2SDJ0eUVXQWowLUN1aXBQVFlUSENVbUlDTFZaU1RmSS1jaWUyNW5YZ1UxQVljdlVQbE5yLTFxWDJiVmdjdzZxRURMc1ZCbXFVU2VraWRVZWxn?oc=5",
    "published_date": "2025-10-02 07:00:00",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMirAJBVV95cUxNcEJ3NUZIZVNyWDk0MHRiVmdsMUN1eDJaUnB0RkNTT3BGdzExRUFkUV9wLTlVaFN6OVM5YlYxSUVzSExoYzA2cHpwZGNnVE4zTkNydUx4Nm9LaHhSYkxDZmpaZWMzOW1oMnlnVVZXd0pUUEM1bXlWUzdyUTlsTUFSTEVPdFNDSWRSU3FmV1VkVmxSSE5memJKNWNyclpqZWhyMmtjUkhCV2hMQzlmbWh1ZGhvUzFpbk91aFBGN2hiWW51QzBad3ByZ1N2aDkybXRfVlMyQWUxSEZrVUdsUzdRSlVOSER0WG5BSG0tQzBJZmtWTkcwOXNGTmZUdnNhMGp1eWZSTnlRQzVYcDNGZVJmM0hEOU44cmFOZGszcnFmNkw0Sm1MaXFuaklmZGPSAbICQVVfeXFMTTBfd2NYZzYyWGFlWXNXV1ZxTFp4ZmxDOGhaUGVTRTU2aFVEZEpCMUJDbkxTYkpkVXQ2RDRrdGVtRVhSLUpHVW1VcVZ3b3B5MzM4Y3dJNjRJYzhXajNlTTNmOFJ0clBKb2dJZzNOZThMNDVyQ3hFc0QxZGRaRUpybWNJZERZZTRrY0NFcWxSNlR3XzB1bnNSYXhtVl9uX0k5ZkFHZlRoOWZYRnFxQ04wT2tjdlpReDlBTUFoTnBNcmNseE8zaEFOQXRtcHZ6TW9MVlJFOFUzUnZSaFBycVBTMlB2SDJ0eUVXQWowLUN1aXBQVFlUSENVbUlDTFZaU1RmSS1jaWUyNW5YZ1UxQVljdlVQbE5yLTFxWDJiVmdjdzZxRURMc1ZCbXFVU2VraWRVZWxn?oc=5\" target=\"_blank\">US stock market today: Dow Jones, S&amp;P 500, and Nasdaq rise as investors eye tech, healthcare, and AI amid</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times</font>",
    "content": "The U.S. stock market showed strength today despite ongoing worries about a government shutdown. Major indexes, including the S&P 500, Nasdaq, and Dow Jones, all posted gains. Investors are watching closely as technology stocks, healthcare, and economic data shape market direction."
  }
]